espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L1_CACHE_BLOCKSIZE_CONF_REG register
 *  L1 data Cache BlockSize mode configure register
 */
#define CACHE_L1_CACHE_BLOCKSIZE_CONF_REG (DR_REG_CACHE_BASE + 0x1c)
/** CACHE_L1_CACHE_BLOCKSIZE_8 : HRO; bitpos: [0]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 8 bytes. This field and all
 *  other fields within this register is onehot.
 */
#define CACHE_L1_CACHE_BLOCKSIZE_8    (BIT(0))
#define CACHE_L1_CACHE_BLOCKSIZE_8_M  (CACHE_L1_CACHE_BLOCKSIZE_8_V << CACHE_L1_CACHE_BLOCKSIZE_8_S)
#define CACHE_L1_CACHE_BLOCKSIZE_8_V  0x00000001U
#define CACHE_L1_CACHE_BLOCKSIZE_8_S  0
/** CACHE_L1_CACHE_BLOCKSIZE_16 : HRO; bitpos: [1]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 16 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_CACHE_BLOCKSIZE_16    (BIT(1))
#define CACHE_L1_CACHE_BLOCKSIZE_16_M  (CACHE_L1_CACHE_BLOCKSIZE_16_V << CACHE_L1_CACHE_BLOCKSIZE_16_S)
#define CACHE_L1_CACHE_BLOCKSIZE_16_V  0x00000001U
#define CACHE_L1_CACHE_BLOCKSIZE_16_S  1
/** CACHE_L1_CACHE_BLOCKSIZE_32 : HRO; bitpos: [2]; default: 1;
 *  The field is used to configureblocksize of L1-DCache as 32 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_CACHE_BLOCKSIZE_32    (BIT(2))
#define CACHE_L1_CACHE_BLOCKSIZE_32_M  (CACHE_L1_CACHE_BLOCKSIZE_32_V << CACHE_L1_CACHE_BLOCKSIZE_32_S)
#define CACHE_L1_CACHE_BLOCKSIZE_32_V  0x00000001U
#define CACHE_L1_CACHE_BLOCKSIZE_32_S  2
/** CACHE_L1_CACHE_BLOCKSIZE_64 : HRO; bitpos: [3]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 64 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_CACHE_BLOCKSIZE_64    (BIT(3))
#define CACHE_L1_CACHE_BLOCKSIZE_64_M  (CACHE_L1_CACHE_BLOCKSIZE_64_V << CACHE_L1_CACHE_BLOCKSIZE_64_S)
#define CACHE_L1_CACHE_BLOCKSIZE_64_V  0x00000001U
#define CACHE_L1_CACHE_BLOCKSIZE_64_S  3
/** CACHE_L1_CACHE_BLOCKSIZE_128 : HRO; bitpos: [4]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 128 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_CACHE_BLOCKSIZE_128    (BIT(4))
#define CACHE_L1_CACHE_BLOCKSIZE_128_M  (CACHE_L1_CACHE_BLOCKSIZE_128_V << CACHE_L1_CACHE_BLOCKSIZE_128_S)
#define CACHE_L1_CACHE_BLOCKSIZE_128_V  0x00000001U
#define CACHE_L1_CACHE_BLOCKSIZE_128_S  4
/** CACHE_L1_CACHE_BLOCKSIZE_256 : HRO; bitpos: [5]; default: 0;
 *  The field is used to configureblocksize of L1-DCache as 256 bytes. This field and
 *  all other fields within this register is onehot.
 */
#define CACHE_L1_CACHE_BLOCKSIZE_256    (BIT(5))
#define CACHE_L1_CACHE_BLOCKSIZE_256_M  (CACHE_L1_CACHE_BLOCKSIZE_256_V << CACHE_L1_CACHE_BLOCKSIZE_256_S)
#define CACHE_L1_CACHE_BLOCKSIZE_256_V  0x00000001U
#define CACHE_L1_CACHE_BLOCKSIZE_256_S  5

/** CACHE_L1_CACHE_WRAP_AROUND_CTRL_REG register
 *  Cache wrap around control register
 */
#define CACHE_L1_CACHE_WRAP_AROUND_CTRL_REG (DR_REG_CACHE_BASE + 0x20)
/** CACHE_L1_ICACHE0_WRAP : HRO; bitpos: [0]; default: 0;
 *  Set this bit as 1 to enable L1-ICache0 wrap around mode.
 */
#define CACHE_L1_ICACHE0_WRAP    (BIT(0))
#define CACHE_L1_ICACHE0_WRAP_M  (CACHE_L1_ICACHE0_WRAP_V << CACHE_L1_ICACHE0_WRAP_S)
#define CACHE_L1_ICACHE0_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE0_WRAP_S  0
/** CACHE_L1_ICACHE1_WRAP : HRO; bitpos: [1]; default: 0;
 *  Set this bit as 1 to enable L1-ICache1 wrap around mode.
 */
#define CACHE_L1_ICACHE1_WRAP    (BIT(1))
#define CACHE_L1_ICACHE1_WRAP_M  (CACHE_L1_ICACHE1_WRAP_V << CACHE_L1_ICACHE1_WRAP_S)
#define CACHE_L1_ICACHE1_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE1_WRAP_S  1
/** CACHE_L1_ICACHE2_WRAP : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_WRAP    (BIT(2))
#define CACHE_L1_ICACHE2_WRAP_M  (CACHE_L1_ICACHE2_WRAP_V << CACHE_L1_ICACHE2_WRAP_S)
#define CACHE_L1_ICACHE2_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE2_WRAP_S  2
/** CACHE_L1_ICACHE3_WRAP : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_WRAP    (BIT(3))
#define CACHE_L1_ICACHE3_WRAP_M  (CACHE_L1_ICACHE3_WRAP_V << CACHE_L1_ICACHE3_WRAP_S)
#define CACHE_L1_ICACHE3_WRAP_V  0x00000001U
#define CACHE_L1_ICACHE3_WRAP_S  3
/** CACHE_L1_CACHE_WRAP : R/W; bitpos: [4]; default: 0;
 *  Set this bit as 1 to enable L1-DCache wrap around mode.
 */
#define CACHE_L1_CACHE_WRAP    (BIT(4))
#define CACHE_L1_CACHE_WRAP_M  (CACHE_L1_CACHE_WRAP_V << CACHE_L1_CACHE_WRAP_S)
#define CACHE_L1_CACHE_WRAP_V  0x00000001U
#define CACHE_L1_CACHE_WRAP_S  4

/** CACHE_L1_CACHE_TAG_MEM_POWER_CTRL_REG register
 *  Cache tag memory power control register
 */
#define CACHE_L1_CACHE_TAG_MEM_POWER_CTRL_REG (DR_REG_CACHE_BASE + 0x24)
/** CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON : HRO; bitpos: [0]; default: 1;
 *  The bit is used to close clock gating of  L1-ICache0 tag memory. 1: close gating,
 *  0: open clock gating.
 */
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON    (BIT(0))
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON_M  (CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON_V << CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_ON_S  0
/** CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD : HRO; bitpos: [1]; default: 0;
 *  The bit is used to power L1-ICache0 tag memory down. 0: follow rtc_lslp, 1: power
 *  down
 */
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD    (BIT(1))
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD_M  (CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD_V << CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PD_S  1
/** CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU : HRO; bitpos: [2]; default: 1;
 *  The bit is used to power L1-ICache0 tag memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU    (BIT(2))
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU_M  (CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU_V << CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE0_TAG_MEM_FORCE_PU_S  2
/** CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON : HRO; bitpos: [4]; default: 1;
 *  The bit is used to close clock gating of  L1-ICache1 tag memory. 1: close gating,
 *  0: open clock gating.
 */
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON    (BIT(4))
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON_M  (CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON_V << CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_ON_S  4
/** CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD : HRO; bitpos: [5]; default: 0;
 *  The bit is used to power L1-ICache1 tag memory down. 0: follow rtc_lslp, 1: power
 *  down
 */
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD    (BIT(5))
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD_M  (CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD_V << CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PD_S  5
/** CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU : HRO; bitpos: [6]; default: 1;
 *  The bit is used to power L1-ICache1 tag memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU    (BIT(6))
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU_M  (CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU_V << CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE1_TAG_MEM_FORCE_PU_S  6
/** CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON : HRO; bitpos: [8]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON    (BIT(8))
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON_M  (CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON_V << CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_ON_S  8
/** CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD : HRO; bitpos: [9]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD    (BIT(9))
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD_M  (CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD_V << CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PD_S  9
/** CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU : HRO; bitpos: [10]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU    (BIT(10))
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU_M  (CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU_V << CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE2_TAG_MEM_FORCE_PU_S  10
/** CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON : HRO; bitpos: [12]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON    (BIT(12))
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON_M  (CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON_V << CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_ON_S  12
/** CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD : HRO; bitpos: [13]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD    (BIT(13))
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD_M  (CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD_V << CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PD_S  13
/** CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU : HRO; bitpos: [14]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU    (BIT(14))
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU_M  (CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU_V << CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE3_TAG_MEM_FORCE_PU_S  14
/** CACHE_L1_CACHE_TAG_MEM_FORCE_ON : R/W; bitpos: [16]; default: 1;
 *  The bit is used to close clock gating of  L1-Cache tag memory. 1: close gating, 0:
 *  open clock gating.
 */
#define CACHE_L1_CACHE_TAG_MEM_FORCE_ON    (BIT(16))
#define CACHE_L1_CACHE_TAG_MEM_FORCE_ON_M  (CACHE_L1_CACHE_TAG_MEM_FORCE_ON_V << CACHE_L1_CACHE_TAG_MEM_FORCE_ON_S)
#define CACHE_L1_CACHE_TAG_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_CACHE_TAG_MEM_FORCE_ON_S  16
/** CACHE_L1_CACHE_TAG_MEM_FORCE_PD : R/W; bitpos: [17]; default: 0;
 *  The bit is used to power L1-Cache tag memory down. 0: follow rtc_lslp, 1: power down
 */
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PD    (BIT(17))
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PD_M  (CACHE_L1_CACHE_TAG_MEM_FORCE_PD_V << CACHE_L1_CACHE_TAG_MEM_FORCE_PD_S)
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PD_S  17
/** CACHE_L1_CACHE_TAG_MEM_FORCE_PU : R/W; bitpos: [18]; default: 1;
 *  The bit is used to power L1-Cache tag memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PU    (BIT(18))
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PU_M  (CACHE_L1_CACHE_TAG_MEM_FORCE_PU_V << CACHE_L1_CACHE_TAG_MEM_FORCE_PU_S)
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_CACHE_TAG_MEM_FORCE_PU_S  18

/** CACHE_L1_CACHE_DATA_MEM_POWER_CTRL_REG register
 *  Cache data memory power control register
 */
#define CACHE_L1_CACHE_DATA_MEM_POWER_CTRL_REG (DR_REG_CACHE_BASE + 0x28)
/** CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON : HRO; bitpos: [0]; default: 1;
 *  The bit is used to close clock gating of  L1-ICache0 data memory. 1: close gating,
 *  0: open clock gating.
 */
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON    (BIT(0))
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON_M  (CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON_V << CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_ON_S  0
/** CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD : HRO; bitpos: [1]; default: 0;
 *  The bit is used to power L1-ICache0 data memory down. 0: follow rtc_lslp, 1: power
 *  down
 */
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD    (BIT(1))
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD_M  (CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD_V << CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PD_S  1
/** CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU : HRO; bitpos: [2]; default: 1;
 *  The bit is used to power L1-ICache0 data memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU    (BIT(2))
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU_M  (CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU_V << CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE0_DATA_MEM_FORCE_PU_S  2
/** CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON : HRO; bitpos: [4]; default: 1;
 *  The bit is used to close clock gating of  L1-ICache1 data memory. 1: close gating,
 *  0: open clock gating.
 */
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON    (BIT(4))
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON_M  (CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON_V << CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_ON_S  4
/** CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD : HRO; bitpos: [5]; default: 0;
 *  The bit is used to power L1-ICache1 data memory down. 0: follow rtc_lslp, 1: power
 *  down
 */
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD    (BIT(5))
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD_M  (CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD_V << CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PD_S  5
/** CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU : HRO; bitpos: [6]; default: 1;
 *  The bit is used to power L1-ICache1 data memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU    (BIT(6))
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU_M  (CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU_V << CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE1_DATA_MEM_FORCE_PU_S  6
/** CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON : HRO; bitpos: [8]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON    (BIT(8))
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON_M  (CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON_V << CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_ON_S  8
/** CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD : HRO; bitpos: [9]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD    (BIT(9))
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD_M  (CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD_V << CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PD_S  9
/** CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU : HRO; bitpos: [10]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU    (BIT(10))
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU_M  (CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU_V << CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE2_DATA_MEM_FORCE_PU_S  10
/** CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON : HRO; bitpos: [12]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON    (BIT(12))
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON_M  (CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON_V << CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON_S)
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_ON_S  12
/** CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD : HRO; bitpos: [13]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD    (BIT(13))
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD_M  (CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD_V << CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD_S)
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PD_S  13
/** CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU : HRO; bitpos: [14]; default: 1;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU    (BIT(14))
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU_M  (CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU_V << CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU_S)
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_ICACHE3_DATA_MEM_FORCE_PU_S  14
/** CACHE_L1_CACHE_DATA_MEM_FORCE_ON : R/W; bitpos: [16]; default: 1;
 *  The bit is used to close clock gating of  L1-Cache data memory. 1: close gating, 0:
 *  open clock gating.
 */
#define CACHE_L1_CACHE_DATA_MEM_FORCE_ON    (BIT(16))
#define CACHE_L1_CACHE_DATA_MEM_FORCE_ON_M  (CACHE_L1_CACHE_DATA_MEM_FORCE_ON_V << CACHE_L1_CACHE_DATA_MEM_FORCE_ON_S)
#define CACHE_L1_CACHE_DATA_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L1_CACHE_DATA_MEM_FORCE_ON_S  16
/** CACHE_L1_CACHE_DATA_MEM_FORCE_PD : R/W; bitpos: [17]; default: 0;
 *  The bit is used to power L1-Cache data memory down. 0: follow rtc_lslp, 1: power
 *  down
 */
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PD    (BIT(17))
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PD_M  (CACHE_L1_CACHE_DATA_MEM_FORCE_PD_V << CACHE_L1_CACHE_DATA_MEM_FORCE_PD_S)
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PD_S  17
/** CACHE_L1_CACHE_DATA_MEM_FORCE_PU : R/W; bitpos: [18]; default: 1;
 *  The bit is used to power L1-Cache data memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PU    (BIT(18))
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PU_M  (CACHE_L1_CACHE_DATA_MEM_FORCE_PU_V << CACHE_L1_CACHE_DATA_MEM_FORCE_PU_S)
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L1_CACHE_DATA_MEM_FORCE_PU_S  18

/** CACHE_L1_CACHE_FREEZE_CTRL_REG register
 *  Cache Freeze control register
 */
#define CACHE_L1_CACHE_FREEZE_CTRL_REG (DR_REG_CACHE_BASE + 0x2c)
/** CACHE_L1_ICACHE0_FREEZE_EN : HRO; bitpos: [0]; default: 0;
 *  The bit is used to enable freeze operation on L1-ICache0. It can be cleared by
 *  software.
 */
#define CACHE_L1_ICACHE0_FREEZE_EN    (BIT(0))
#define CACHE_L1_ICACHE0_FREEZE_EN_M  (CACHE_L1_ICACHE0_FREEZE_EN_V << CACHE_L1_ICACHE0_FREEZE_EN_S)
#define CACHE_L1_ICACHE0_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE0_FREEZE_EN_S  0
/** CACHE_L1_ICACHE0_FREEZE_MODE : HRO; bitpos: [1]; default: 0;
 *  The bit is used to configure mode of freeze operation L1-ICache0. 0: a miss-access
 *  will not stuck. 1: a miss-access will stuck.
 */
#define CACHE_L1_ICACHE0_FREEZE_MODE    (BIT(1))
#define CACHE_L1_ICACHE0_FREEZE_MODE_M  (CACHE_L1_ICACHE0_FREEZE_MODE_V << CACHE_L1_ICACHE0_FREEZE_MODE_S)
#define CACHE_L1_ICACHE0_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE0_FREEZE_MODE_S  1
/** CACHE_L1_ICACHE0_FREEZE_DONE : RO; bitpos: [2]; default: 0;
 *  The bit is used to indicate whether freeze operation on L1-ICache0 is finished or
 *  not. 0: not finished. 1: finished.
 */
#define CACHE_L1_ICACHE0_FREEZE_DONE    (BIT(2))
#define CACHE_L1_ICACHE0_FREEZE_DONE_M  (CACHE_L1_ICACHE0_FREEZE_DONE_V << CACHE_L1_ICACHE0_FREEZE_DONE_S)
#define CACHE_L1_ICACHE0_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE0_FREEZE_DONE_S  2
/** CACHE_L1_ICACHE1_FREEZE_EN : HRO; bitpos: [4]; default: 0;
 *  The bit is used to enable freeze operation on L1-ICache1. It can be cleared by
 *  software.
 */
#define CACHE_L1_ICACHE1_FREEZE_EN    (BIT(4))
#define CACHE_L1_ICACHE1_FREEZE_EN_M  (CACHE_L1_ICACHE1_FREEZE_EN_V << CACHE_L1_ICACHE1_FREEZE_EN_S)
#define CACHE_L1_ICACHE1_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE1_FREEZE_EN_S  4
/** CACHE_L1_ICACHE1_FREEZE_MODE : HRO; bitpos: [5]; default: 0;
 *  The bit is used to configure mode of freeze operation L1-ICache1. 0: a miss-access
 *  will not stuck. 1: a miss-access will stuck.
 */
#define CACHE_L1_ICACHE1_FREEZE_MODE    (BIT(5))
#define CACHE_L1_ICACHE1_FREEZE_MODE_M  (CACHE_L1_ICACHE1_FREEZE_MODE_V << CACHE_L1_ICACHE1_FREEZE_MODE_S)
#define CACHE_L1_ICACHE1_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE1_FREEZE_MODE_S  5
/** CACHE_L1_ICACHE1_FREEZE_DONE : RO; bitpos: [6]; default: 0;
 *  The bit is used to indicate whether freeze operation on L1-ICache1 is finished or
 *  not. 0: not finished. 1: finished.
 */
#define CACHE_L1_ICACHE1_FREEZE_DONE    (BIT(6))
#define CACHE_L1_ICACHE1_FREEZE_DONE_M  (CACHE_L1_ICACHE1_FREEZE_DONE_V << CACHE_L1_ICACHE1_FREEZE_DONE_S)
#define CACHE_L1_ICACHE1_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE1_FREEZE_DONE_S  6
/** CACHE_L1_ICACHE2_FREEZE_EN : HRO; bitpos: [8]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FREEZE_EN    (BIT(8))
#define CACHE_L1_ICACHE2_FREEZE_EN_M  (CACHE_L1_ICACHE2_FREEZE_EN_V << CACHE_L1_ICACHE2_FREEZE_EN_S)
#define CACHE_L1_ICACHE2_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE2_FREEZE_EN_S  8
/** CACHE_L1_ICACHE2_FREEZE_MODE : HRO; bitpos: [9]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FREEZE_MODE    (BIT(9))
#define CACHE_L1_ICACHE2_FREEZE_MODE_M  (CACHE_L1_ICACHE2_FREEZE_MODE_V << CACHE_L1_ICACHE2_FREEZE_MODE_S)
#define CACHE_L1_ICACHE2_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE2_FREEZE_MODE_S  9
/** CACHE_L1_ICACHE2_FREEZE_DONE : RO; bitpos: [10]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FREEZE_DONE    (BIT(10))
#define CACHE_L1_ICACHE2_FREEZE_DONE_M  (CACHE_L1_ICACHE2_FREEZE_DONE_V << CACHE_L1_ICACHE2_FREEZE_DONE_S)
#define CACHE_L1_ICACHE2_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE2_FREEZE_DONE_S  10
/** CACHE_L1_ICACHE3_FREEZE_EN : HRO; bitpos: [12]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FREEZE_EN    (BIT(12))
#define CACHE_L1_ICACHE3_FREEZE_EN_M  (CACHE_L1_ICACHE3_FREEZE_EN_V << CACHE_L1_ICACHE3_FREEZE_EN_S)
#define CACHE_L1_ICACHE3_FREEZE_EN_V  0x00000001U
#define CACHE_L1_ICACHE3_FREEZE_EN_S  12
/** CACHE_L1_ICACHE3_FREEZE_MODE : HRO; bitpos: [13]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FREEZE_MODE    (BIT(13))
#define CACHE_L1_ICACHE3_FREEZE_MODE_M  (CACHE_L1_ICACHE3_FREEZE_MODE_V << CACHE_L1_ICACHE3_FREEZE_MODE_S)
#define CACHE_L1_ICACHE3_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_ICACHE3_FREEZE_MODE_S  13
/** CACHE_L1_ICACHE3_FREEZE_DONE : RO; bitpos: [14]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FREEZE_DONE    (BIT(14))
#define CACHE_L1_ICACHE3_FREEZE_DONE_M  (CACHE_L1_ICACHE3_FREEZE_DONE_V << CACHE_L1_ICACHE3_FREEZE_DONE_S)
#define CACHE_L1_ICACHE3_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_ICACHE3_FREEZE_DONE_S  14
/** CACHE_L1_CACHE_FREEZE_EN : R/W; bitpos: [16]; default: 0;
 *  The bit is used to enable freeze operation on L1-Cache. It can be cleared by
 *  software.
 */
#define CACHE_L1_CACHE_FREEZE_EN    (BIT(16))
#define CACHE_L1_CACHE_FREEZE_EN_M  (CACHE_L1_CACHE_FREEZE_EN_V << CACHE_L1_CACHE_FREEZE_EN_S)
#define CACHE_L1_CACHE_FREEZE_EN_V  0x00000001U
#define CACHE_L1_CACHE_FREEZE_EN_S  16
/** CACHE_L1_CACHE_FREEZE_MODE : R/W; bitpos: [17]; default: 0;
 *  The bit is used to configure mode of freeze operation L1-Cache. 0: a miss-access
 *  will not stuck. 1: a miss-access will stuck.
 */
#define CACHE_L1_CACHE_FREEZE_MODE    (BIT(17))
#define CACHE_L1_CACHE_FREEZE_MODE_M  (CACHE_L1_CACHE_FREEZE_MODE_V << CACHE_L1_CACHE_FREEZE_MODE_S)
#define CACHE_L1_CACHE_FREEZE_MODE_V  0x00000001U
#define CACHE_L1_CACHE_FREEZE_MODE_S  17
/** CACHE_L1_CACHE_FREEZE_DONE : RO; bitpos: [18]; default: 0;
 *  The bit is used to indicate whether freeze operation on L1-Cache is finished or
 *  not. 0: not finished. 1: finished.
 */
#define CACHE_L1_CACHE_FREEZE_DONE    (BIT(18))
#define CACHE_L1_CACHE_FREEZE_DONE_M  (CACHE_L1_CACHE_FREEZE_DONE_V << CACHE_L1_CACHE_FREEZE_DONE_S)
#define CACHE_L1_CACHE_FREEZE_DONE_V  0x00000001U
#define CACHE_L1_CACHE_FREEZE_DONE_S  18

