espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L1_ICACHE0_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 0 preload size configure register
 */
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xb0)
/** CACHE_L1_ICACHE0_PRELOAD_SIZE : HRO; bitpos: [13:0]; default: 0;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_ADDR_REG
 */
#define CACHE_L1_ICACHE0_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_M  (CACHE_L1_ICACHE0_PRELOAD_SIZE_V << CACHE_L1_ICACHE0_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE0_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE1_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 1 preload-operation control register
 */
#define CACHE_L1_ICACHE1_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xb4)
/** CACHE_L1_ICACHE1_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  The bit is used to enable preload operation on L1-ICache1. It will be cleared by
 *  hardware automatically after preload operation is done.
 */
#define CACHE_L1_ICACHE1_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE1_PRELOAD_ENA_M  (CACHE_L1_ICACHE1_PRELOAD_ENA_V << CACHE_L1_ICACHE1_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE1_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE1_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 */
#define CACHE_L1_ICACHE1_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE1_PRELOAD_DONE_M  (CACHE_L1_ICACHE1_PRELOAD_DONE_V << CACHE_L1_ICACHE1_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE1_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE1_PRELOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
 *  descending.
 */
#define CACHE_L1_ICACHE1_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE1_PRELOAD_ORDER_M  (CACHE_L1_ICACHE1_PRELOAD_ORDER_V << CACHE_L1_ICACHE1_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE1_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE1_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE1_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  The bit is used to set  the gid of l1 icache1 preload.
 */
#define CACHE_L1_ICACHE1_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE1_PRELOAD_RGID_M  (CACHE_L1_ICACHE1_PRELOAD_RGID_V << CACHE_L1_ICACHE1_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE1_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE1_PRELOAD_RGID_S  3

/** CACHE_L1_ICACHE1_PRELOAD_ADDR_REG register
 *  L1 instruction Cache 1 preload address configure register
 */
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xb8)
/** CACHE_L1_ICACHE1_PRELOAD_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of preload on
 *  L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_SIZE_REG
 */
#define CACHE_L1_ICACHE1_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_M  (CACHE_L1_ICACHE1_PRELOAD_ADDR_V << CACHE_L1_ICACHE1_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE1_PRELOAD_ADDR_S  0

/** CACHE_L1_ICACHE1_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 1 preload size configure register
 */
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xbc)
/** CACHE_L1_ICACHE1_PRELOAD_SIZE : HRO; bitpos: [13:0]; default: 0;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_ADDR_REG
 */
#define CACHE_L1_ICACHE1_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_M  (CACHE_L1_ICACHE1_PRELOAD_SIZE_V << CACHE_L1_ICACHE1_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE1_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE2_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 2 preload-operation control register
 */
#define CACHE_L1_ICACHE2_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xc0)
/** CACHE_L1_ICACHE2_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  The bit is used to enable preload operation on L1-ICache2. It will be cleared by
 *  hardware automatically after preload operation is done.
 */
#define CACHE_L1_ICACHE2_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE2_PRELOAD_ENA_M  (CACHE_L1_ICACHE2_PRELOAD_ENA_V << CACHE_L1_ICACHE2_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE2_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE2_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 */
#define CACHE_L1_ICACHE2_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE2_PRELOAD_DONE_M  (CACHE_L1_ICACHE2_PRELOAD_DONE_V << CACHE_L1_ICACHE2_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE2_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE2_PRELOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
 *  descending.
 */
#define CACHE_L1_ICACHE2_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE2_PRELOAD_ORDER_M  (CACHE_L1_ICACHE2_PRELOAD_ORDER_V << CACHE_L1_ICACHE2_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE2_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE2_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE2_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  The bit is used to set  the gid of l1 icache2 preload.
 */
#define CACHE_L1_ICACHE2_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE2_PRELOAD_RGID_M  (CACHE_L1_ICACHE2_PRELOAD_RGID_V << CACHE_L1_ICACHE2_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE2_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE2_PRELOAD_RGID_S  3

/** CACHE_L1_ICACHE2_PRELOAD_ADDR_REG register
 *  L1 instruction Cache 2 preload address configure register
 */
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xc4)
/** CACHE_L1_ICACHE2_PRELOAD_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of preload on
 *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_SIZE_REG
 */
#define CACHE_L1_ICACHE2_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_M  (CACHE_L1_ICACHE2_PRELOAD_ADDR_V << CACHE_L1_ICACHE2_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE2_PRELOAD_ADDR_S  0

/** CACHE_L1_ICACHE2_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 2 preload size configure register
 */
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xc8)
/** CACHE_L1_ICACHE2_PRELOAD_SIZE : HRO; bitpos: [13:0]; default: 0;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_ADDR_REG
 */
#define CACHE_L1_ICACHE2_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_M  (CACHE_L1_ICACHE2_PRELOAD_SIZE_V << CACHE_L1_ICACHE2_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE2_PRELOAD_SIZE_S  0

/** CACHE_L1_ICACHE3_PRELOAD_CTRL_REG register
 *  L1 instruction Cache 3 preload-operation control register
 */
#define CACHE_L1_ICACHE3_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0xcc)
/** CACHE_L1_ICACHE3_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  The bit is used to enable preload operation on L1-ICache3. It will be cleared by
 *  hardware automatically after preload operation is done.
 */
#define CACHE_L1_ICACHE3_PRELOAD_ENA    (BIT(0))
#define CACHE_L1_ICACHE3_PRELOAD_ENA_M  (CACHE_L1_ICACHE3_PRELOAD_ENA_V << CACHE_L1_ICACHE3_PRELOAD_ENA_S)
#define CACHE_L1_ICACHE3_PRELOAD_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_ENA_S  0
/** CACHE_L1_ICACHE3_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 */
#define CACHE_L1_ICACHE3_PRELOAD_DONE    (BIT(1))
#define CACHE_L1_ICACHE3_PRELOAD_DONE_M  (CACHE_L1_ICACHE3_PRELOAD_DONE_V << CACHE_L1_ICACHE3_PRELOAD_DONE_S)
#define CACHE_L1_ICACHE3_PRELOAD_DONE_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_DONE_S  1
/** CACHE_L1_ICACHE3_PRELOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
 *  descending.
 */
#define CACHE_L1_ICACHE3_PRELOAD_ORDER    (BIT(2))
#define CACHE_L1_ICACHE3_PRELOAD_ORDER_M  (CACHE_L1_ICACHE3_PRELOAD_ORDER_V << CACHE_L1_ICACHE3_PRELOAD_ORDER_S)
#define CACHE_L1_ICACHE3_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L1_ICACHE3_PRELOAD_ORDER_S  2
/** CACHE_L1_ICACHE3_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  The bit is used to set  the gid of l1 icache3 preload.
 */
#define CACHE_L1_ICACHE3_PRELOAD_RGID    0x0000000FU
#define CACHE_L1_ICACHE3_PRELOAD_RGID_M  (CACHE_L1_ICACHE3_PRELOAD_RGID_V << CACHE_L1_ICACHE3_PRELOAD_RGID_S)
#define CACHE_L1_ICACHE3_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L1_ICACHE3_PRELOAD_RGID_S  3

/** CACHE_L1_ICACHE3_PRELOAD_ADDR_REG register
 *  L1 instruction Cache 3 preload address configure register
 */
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0xd0)
/** CACHE_L1_ICACHE3_PRELOAD_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of preload on
 *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_SIZE_REG
 */
#define CACHE_L1_ICACHE3_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_M  (CACHE_L1_ICACHE3_PRELOAD_ADDR_V << CACHE_L1_ICACHE3_PRELOAD_ADDR_S)
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_ICACHE3_PRELOAD_ADDR_S  0

/** CACHE_L1_ICACHE3_PRELOAD_SIZE_REG register
 *  L1 instruction Cache 3 preload size configure register
 */
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_REG (DR_REG_CACHE_BASE + 0xd4)
/** CACHE_L1_ICACHE3_PRELOAD_SIZE : HRO; bitpos: [13:0]; default: 0;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_ADDR_REG
 */
#define CACHE_L1_ICACHE3_PRELOAD_SIZE    0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_M  (CACHE_L1_ICACHE3_PRELOAD_SIZE_V << CACHE_L1_ICACHE3_PRELOAD_SIZE_S)
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_V  0x00003FFFU
#define CACHE_L1_ICACHE3_PRELOAD_SIZE_S  0

