espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_REG register
 *  L1 Cache autoload section 0 address configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x138)
/** CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the first section for
 *  autoload operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT0_SIZE and L1_CACHE_AUTOLOAD_SCT0_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_M  (CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_V << CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_ADDR_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_REG register
 *  L1 Cache autoload section 0 size configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_REG (DR_REG_CACHE_BASE + 0x13c)
/** CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE : R/W; bitpos: [23:0]; default: 0;
 *  Those bits are used to configure the size of the first section for autoload
 *  operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT0_ADDR and L1_CACHE_AUTOLOAD_SCT0_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE    0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_M  (CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_V << CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_V  0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT0_SIZE_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_REG register
 *  L1 Cache autoload section 1 address configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x140)
/** CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the second section
 *  for autoload operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT1_SIZE and L1_CACHE_AUTOLOAD_SCT1_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_M  (CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_V << CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_ADDR_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_REG register
 *  L1 Cache autoload section 1 size configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_REG (DR_REG_CACHE_BASE + 0x144)
/** CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE : R/W; bitpos: [23:0]; default: 0;
 *  Those bits are used to configure the size of the second section for autoload
 *  operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT1_ADDR and L1_CACHE_AUTOLOAD_SCT1_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE    0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_M  (CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_V << CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_V  0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT1_SIZE_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_REG register
 *  L1 Cache autoload section 2 address configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_REG (DR_REG_CACHE_BASE + 0x148)
/** CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the third section for
 *  autoload operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT2_SIZE and L1_CACHE_AUTOLOAD_SCT2_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR    0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_M  (CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_V << CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_ADDR_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_REG register
 *  L1 Cache autoload section 2 size configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_REG (DR_REG_CACHE_BASE + 0x14c)
/** CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE : HRO; bitpos: [23:0]; default: 0;
 *  Those bits are used to configure the size of the third section for autoload
 *  operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT2_ADDR and L1_CACHE_AUTOLOAD_SCT2_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE    0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_M  (CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_V << CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_V  0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT2_SIZE_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_REG register
 *  L1 Cache autoload section 1 address configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_REG (DR_REG_CACHE_BASE + 0x150)
/** CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the fourth section
 *  for autoload operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT3_SIZE and L1_CACHE_AUTOLOAD_SCT3_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR    0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_M  (CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_V << CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_V  0xFFFFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_ADDR_S  0

/** CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_REG register
 *  L1 Cache autoload section 1 size configure register
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_REG (DR_REG_CACHE_BASE + 0x154)
/** CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE : HRO; bitpos: [23:0]; default: 0;
 *  Those bits are used to configure the size of the fourth section for autoload
 *  operation on L1-Cache. Note that it should be used together with
 *  L1_CACHE_AUTOLOAD_SCT3_ADDR and L1_CACHE_AUTOLOAD_SCT3_ENA.
 */
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE    0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_M  (CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_V << CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_S)
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_V  0x00FFFFFFU
#define CACHE_L1_CACHE_AUTOLOAD_SCT3_SIZE_S  0

/** CACHE_L1_CACHE_ACS_CNT_INT_ENA_REG register
 *  Cache Access Counter Interrupt enable register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_ENA_REG (DR_REG_CACHE_BASE + 0x158)
/** CACHE_L1_IBUS0_OVF_INT_ENA : HRO; bitpos: [0]; default: 0;
 *  The bit is used to enable interrupt of one of counters overflow that occurs in
 *  L1-ICache0 due to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_ENA    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_ENA_M  (CACHE_L1_IBUS0_OVF_INT_ENA_V << CACHE_L1_IBUS0_OVF_INT_ENA_S)
#define CACHE_L1_IBUS0_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_ENA_S  0
/** CACHE_L1_IBUS1_OVF_INT_ENA : HRO; bitpos: [1]; default: 0;
 *  The bit is used to enable interrupt of one of counters overflow that occurs in
 *  L1-ICache1 due to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_ENA    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_ENA_M  (CACHE_L1_IBUS1_OVF_INT_ENA_V << CACHE_L1_IBUS1_OVF_INT_ENA_S)
#define CACHE_L1_IBUS1_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_ENA_S  1
/** CACHE_L1_IBUS2_OVF_INT_ENA : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_OVF_INT_ENA    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_ENA_M  (CACHE_L1_IBUS2_OVF_INT_ENA_V << CACHE_L1_IBUS2_OVF_INT_ENA_S)
#define CACHE_L1_IBUS2_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_ENA_S  2
/** CACHE_L1_IBUS3_OVF_INT_ENA : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_OVF_INT_ENA    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_ENA_M  (CACHE_L1_IBUS3_OVF_INT_ENA_V << CACHE_L1_IBUS3_OVF_INT_ENA_S)
#define CACHE_L1_IBUS3_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_ENA_S  3
/** CACHE_L1_BUS0_OVF_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The bit is used to enable interrupt of one of counters overflow that occurs in
 *  L1-DCache due to bus0 accesses L1-DCache.
 */
#define CACHE_L1_BUS0_OVF_INT_ENA    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_ENA_M  (CACHE_L1_BUS0_OVF_INT_ENA_V << CACHE_L1_BUS0_OVF_INT_ENA_S)
#define CACHE_L1_BUS0_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_BUS0_OVF_INT_ENA_S  4
/** CACHE_L1_BUS1_OVF_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The bit is used to enable interrupt of one of counters overflow that occurs in
 *  L1-DCache due to bus1 accesses L1-DCache.
 */
#define CACHE_L1_BUS1_OVF_INT_ENA    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_ENA_M  (CACHE_L1_BUS1_OVF_INT_ENA_V << CACHE_L1_BUS1_OVF_INT_ENA_S)
#define CACHE_L1_BUS1_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_BUS1_OVF_INT_ENA_S  5
/** CACHE_L1_DBUS2_OVF_INT_ENA : HRO; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_OVF_INT_ENA    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_ENA_M  (CACHE_L1_DBUS2_OVF_INT_ENA_V << CACHE_L1_DBUS2_OVF_INT_ENA_S)
#define CACHE_L1_DBUS2_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_ENA_S  6
/** CACHE_L1_DBUS3_OVF_INT_ENA : HRO; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_OVF_INT_ENA    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_ENA_M  (CACHE_L1_DBUS3_OVF_INT_ENA_V << CACHE_L1_DBUS3_OVF_INT_ENA_S)
#define CACHE_L1_DBUS3_OVF_INT_ENA_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_ENA_S  7

/** CACHE_L1_CACHE_ACS_CNT_INT_CLR_REG register
 *  Cache Access Counter Interrupt clear register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_CLR_REG (DR_REG_CACHE_BASE + 0x15c)
/** CACHE_L1_IBUS0_OVF_INT_CLR : HRO; bitpos: [0]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-ICache0 due
 *  to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_CLR    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_CLR_M  (CACHE_L1_IBUS0_OVF_INT_CLR_V << CACHE_L1_IBUS0_OVF_INT_CLR_S)
#define CACHE_L1_IBUS0_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_CLR_S  0
/** CACHE_L1_IBUS1_OVF_INT_CLR : HRO; bitpos: [1]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-ICache1 due
 *  to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_CLR    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_CLR_M  (CACHE_L1_IBUS1_OVF_INT_CLR_V << CACHE_L1_IBUS1_OVF_INT_CLR_S)
#define CACHE_L1_IBUS1_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_CLR_S  1
/** CACHE_L1_IBUS2_OVF_INT_CLR : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_OVF_INT_CLR    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_CLR_M  (CACHE_L1_IBUS2_OVF_INT_CLR_V << CACHE_L1_IBUS2_OVF_INT_CLR_S)
#define CACHE_L1_IBUS2_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_CLR_S  2
/** CACHE_L1_IBUS3_OVF_INT_CLR : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_OVF_INT_CLR    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_CLR_M  (CACHE_L1_IBUS3_OVF_INT_CLR_V << CACHE_L1_IBUS3_OVF_INT_CLR_S)
#define CACHE_L1_IBUS3_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_CLR_S  3
/** CACHE_L1_BUS0_OVF_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-DCache due
 *  to bus0 accesses L1-DCache.
 */
#define CACHE_L1_BUS0_OVF_INT_CLR    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_CLR_M  (CACHE_L1_BUS0_OVF_INT_CLR_V << CACHE_L1_BUS0_OVF_INT_CLR_S)
#define CACHE_L1_BUS0_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_BUS0_OVF_INT_CLR_S  4
/** CACHE_L1_BUS1_OVF_INT_CLR : WT; bitpos: [5]; default: 0;
 *  The bit is used to clear counters overflow interrupt and counters in L1-DCache due
 *  to bus1 accesses L1-DCache.
 */
#define CACHE_L1_BUS1_OVF_INT_CLR    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_CLR_M  (CACHE_L1_BUS1_OVF_INT_CLR_V << CACHE_L1_BUS1_OVF_INT_CLR_S)
#define CACHE_L1_BUS1_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_BUS1_OVF_INT_CLR_S  5
/** CACHE_L1_DBUS2_OVF_INT_CLR : HRO; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_OVF_INT_CLR    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_CLR_M  (CACHE_L1_DBUS2_OVF_INT_CLR_V << CACHE_L1_DBUS2_OVF_INT_CLR_S)
#define CACHE_L1_DBUS2_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_CLR_S  6
/** CACHE_L1_DBUS3_OVF_INT_CLR : HRO; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_OVF_INT_CLR    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_CLR_M  (CACHE_L1_DBUS3_OVF_INT_CLR_V << CACHE_L1_DBUS3_OVF_INT_CLR_S)
#define CACHE_L1_DBUS3_OVF_INT_CLR_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_CLR_S  7

/** CACHE_L1_CACHE_ACS_CNT_INT_RAW_REG register
 *  Cache Access Counter Interrupt raw register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_RAW_REG (DR_REG_CACHE_BASE + 0x160)
/** CACHE_L1_IBUS0_OVF_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache0
 *  due to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_RAW    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_RAW_M  (CACHE_L1_IBUS0_OVF_INT_RAW_V << CACHE_L1_IBUS0_OVF_INT_RAW_S)
#define CACHE_L1_IBUS0_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_RAW_S  0
/** CACHE_L1_IBUS1_OVF_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache1
 *  due to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_RAW    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_RAW_M  (CACHE_L1_IBUS1_OVF_INT_RAW_V << CACHE_L1_IBUS1_OVF_INT_RAW_S)
#define CACHE_L1_IBUS1_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_RAW_S  1
/** CACHE_L1_IBUS2_OVF_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache2
 *  due to bus2 accesses L1-ICache2.
 */
#define CACHE_L1_IBUS2_OVF_INT_RAW    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_RAW_M  (CACHE_L1_IBUS2_OVF_INT_RAW_V << CACHE_L1_IBUS2_OVF_INT_RAW_S)
#define CACHE_L1_IBUS2_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_RAW_S  2
/** CACHE_L1_IBUS3_OVF_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-ICache3
 *  due to bus3 accesses L1-ICache3.
 */
#define CACHE_L1_IBUS3_OVF_INT_RAW    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_RAW_M  (CACHE_L1_IBUS3_OVF_INT_RAW_V << CACHE_L1_IBUS3_OVF_INT_RAW_S)
#define CACHE_L1_IBUS3_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_RAW_S  3
/** CACHE_L1_BUS0_OVF_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus0 accesses L1-DCache.
 */
#define CACHE_L1_BUS0_OVF_INT_RAW    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_RAW_M  (CACHE_L1_BUS0_OVF_INT_RAW_V << CACHE_L1_BUS0_OVF_INT_RAW_S)
#define CACHE_L1_BUS0_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_BUS0_OVF_INT_RAW_S  4
/** CACHE_L1_BUS1_OVF_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus1 accesses L1-DCache.
 */
#define CACHE_L1_BUS1_OVF_INT_RAW    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_RAW_M  (CACHE_L1_BUS1_OVF_INT_RAW_V << CACHE_L1_BUS1_OVF_INT_RAW_S)
#define CACHE_L1_BUS1_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_BUS1_OVF_INT_RAW_S  5
/** CACHE_L1_DBUS2_OVF_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus2 accesses L1-DCache.
 */
#define CACHE_L1_DBUS2_OVF_INT_RAW    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_RAW_M  (CACHE_L1_DBUS2_OVF_INT_RAW_V << CACHE_L1_DBUS2_OVF_INT_RAW_S)
#define CACHE_L1_DBUS2_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_RAW_S  6
/** CACHE_L1_DBUS3_OVF_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw bit of the interrupt of one of counters overflow that occurs in L1-DCache
 *  due to bus3 accesses L1-DCache.
 */
#define CACHE_L1_DBUS3_OVF_INT_RAW    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_RAW_M  (CACHE_L1_DBUS3_OVF_INT_RAW_V << CACHE_L1_DBUS3_OVF_INT_RAW_S)
#define CACHE_L1_DBUS3_OVF_INT_RAW_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_RAW_S  7

/** CACHE_L1_CACHE_ACS_CNT_INT_ST_REG register
 *  Cache Access Counter Interrupt status register
 */
#define CACHE_L1_CACHE_ACS_CNT_INT_ST_REG (DR_REG_CACHE_BASE + 0x164)
/** CACHE_L1_IBUS0_OVF_INT_ST : HRO; bitpos: [0]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-ICache0 due to bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_OVF_INT_ST    (BIT(0))
#define CACHE_L1_IBUS0_OVF_INT_ST_M  (CACHE_L1_IBUS0_OVF_INT_ST_V << CACHE_L1_IBUS0_OVF_INT_ST_S)
#define CACHE_L1_IBUS0_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS0_OVF_INT_ST_S  0
/** CACHE_L1_IBUS1_OVF_INT_ST : HRO; bitpos: [1]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-ICache1 due to bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_OVF_INT_ST    (BIT(1))
#define CACHE_L1_IBUS1_OVF_INT_ST_M  (CACHE_L1_IBUS1_OVF_INT_ST_V << CACHE_L1_IBUS1_OVF_INT_ST_S)
#define CACHE_L1_IBUS1_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS1_OVF_INT_ST_S  1
/** CACHE_L1_IBUS2_OVF_INT_ST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_OVF_INT_ST    (BIT(2))
#define CACHE_L1_IBUS2_OVF_INT_ST_M  (CACHE_L1_IBUS2_OVF_INT_ST_V << CACHE_L1_IBUS2_OVF_INT_ST_S)
#define CACHE_L1_IBUS2_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS2_OVF_INT_ST_S  2
/** CACHE_L1_IBUS3_OVF_INT_ST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_OVF_INT_ST    (BIT(3))
#define CACHE_L1_IBUS3_OVF_INT_ST_M  (CACHE_L1_IBUS3_OVF_INT_ST_V << CACHE_L1_IBUS3_OVF_INT_ST_S)
#define CACHE_L1_IBUS3_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_IBUS3_OVF_INT_ST_S  3
/** CACHE_L1_BUS0_OVF_INT_ST : RO; bitpos: [4]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-DCache due to bus0 accesses L1-DCache.
 */
#define CACHE_L1_BUS0_OVF_INT_ST    (BIT(4))
#define CACHE_L1_BUS0_OVF_INT_ST_M  (CACHE_L1_BUS0_OVF_INT_ST_V << CACHE_L1_BUS0_OVF_INT_ST_S)
#define CACHE_L1_BUS0_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_BUS0_OVF_INT_ST_S  4
/** CACHE_L1_BUS1_OVF_INT_ST : RO; bitpos: [5]; default: 0;
 *  The bit indicates the interrupt status of one of counters overflow that occurs in
 *  L1-DCache due to bus1 accesses L1-DCache.
 */
#define CACHE_L1_BUS1_OVF_INT_ST    (BIT(5))
#define CACHE_L1_BUS1_OVF_INT_ST_M  (CACHE_L1_BUS1_OVF_INT_ST_V << CACHE_L1_BUS1_OVF_INT_ST_S)
#define CACHE_L1_BUS1_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_BUS1_OVF_INT_ST_S  5
/** CACHE_L1_DBUS2_OVF_INT_ST : HRO; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_OVF_INT_ST    (BIT(6))
#define CACHE_L1_DBUS2_OVF_INT_ST_M  (CACHE_L1_DBUS2_OVF_INT_ST_V << CACHE_L1_DBUS2_OVF_INT_ST_S)
#define CACHE_L1_DBUS2_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_DBUS2_OVF_INT_ST_S  6
/** CACHE_L1_DBUS3_OVF_INT_ST : HRO; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_OVF_INT_ST    (BIT(7))
#define CACHE_L1_DBUS3_OVF_INT_ST_M  (CACHE_L1_DBUS3_OVF_INT_ST_V << CACHE_L1_DBUS3_OVF_INT_ST_S)
#define CACHE_L1_DBUS3_OVF_INT_ST_V  0x00000001U
#define CACHE_L1_DBUS3_OVF_INT_ST_S  7

/** CACHE_L1_CACHE_ACS_FAIL_INT_ENA_REG register
 *  Cache Access Fail Interrupt enable register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_ENA_REG (DR_REG_CACHE_BASE + 0x168)
/** CACHE_L1_ICACHE0_FAIL_INT_ENA : HRO; bitpos: [0]; default: 0;
 *  The bit is used to enable interrupt of access fail that occurs in L1-ICache0 due to
 *  cpu accesses L1-ICache0.
 */
#define CACHE_L1_ICACHE0_FAIL_INT_ENA    (BIT(0))
#define CACHE_L1_ICACHE0_FAIL_INT_ENA_M  (CACHE_L1_ICACHE0_FAIL_INT_ENA_V << CACHE_L1_ICACHE0_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE0_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE0_FAIL_INT_ENA_S  0
/** CACHE_L1_ICACHE1_FAIL_INT_ENA : HRO; bitpos: [1]; default: 0;
 *  The bit is used to enable interrupt of access fail that occurs in L1-ICache1 due to
 *  cpu accesses L1-ICache1.
 */
#define CACHE_L1_ICACHE1_FAIL_INT_ENA    (BIT(1))
#define CACHE_L1_ICACHE1_FAIL_INT_ENA_M  (CACHE_L1_ICACHE1_FAIL_INT_ENA_V << CACHE_L1_ICACHE1_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE1_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE1_FAIL_INT_ENA_S  1
/** CACHE_L1_ICACHE2_FAIL_INT_ENA : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FAIL_INT_ENA    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_ENA_M  (CACHE_L1_ICACHE2_FAIL_INT_ENA_V << CACHE_L1_ICACHE2_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE2_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_ENA_S  2
/** CACHE_L1_ICACHE3_FAIL_INT_ENA : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FAIL_INT_ENA    (BIT(3))
#define CACHE_L1_ICACHE3_FAIL_INT_ENA_M  (CACHE_L1_ICACHE3_FAIL_INT_ENA_V << CACHE_L1_ICACHE3_FAIL_INT_ENA_S)
#define CACHE_L1_ICACHE3_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_ICACHE3_FAIL_INT_ENA_S  3
/** CACHE_L1_CACHE_FAIL_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The bit is used to enable interrupt of access fail that occurs in L1-DCache due to
 *  cpu accesses L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_ENA    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ENA_M  (CACHE_L1_CACHE_FAIL_INT_ENA_V << CACHE_L1_CACHE_FAIL_INT_ENA_S)
#define CACHE_L1_CACHE_FAIL_INT_ENA_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_ENA_S  4

