espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L1_CACHE_ACS_FAIL_INT_CLR_REG register
 *  L1-Cache Access Fail Interrupt clear register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_CLR_REG (DR_REG_CACHE_BASE + 0x16c)
/** CACHE_L1_ICACHE0_FAIL_INT_CLR : HRO; bitpos: [0]; default: 0;
 *  The bit is used to clear interrupt of access fail that occurs in L1-ICache0 due to
 *  cpu accesses L1-ICache0.
 */
#define CACHE_L1_ICACHE0_FAIL_INT_CLR    (BIT(0))
#define CACHE_L1_ICACHE0_FAIL_INT_CLR_M  (CACHE_L1_ICACHE0_FAIL_INT_CLR_V << CACHE_L1_ICACHE0_FAIL_INT_CLR_S)
#define CACHE_L1_ICACHE0_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE0_FAIL_INT_CLR_S  0
/** CACHE_L1_ICACHE1_FAIL_INT_CLR : HRO; bitpos: [1]; default: 0;
 *  The bit is used to clear interrupt of access fail that occurs in L1-ICache1 due to
 *  cpu accesses L1-ICache1.
 */
#define CACHE_L1_ICACHE1_FAIL_INT_CLR    (BIT(1))
#define CACHE_L1_ICACHE1_FAIL_INT_CLR_M  (CACHE_L1_ICACHE1_FAIL_INT_CLR_V << CACHE_L1_ICACHE1_FAIL_INT_CLR_S)
#define CACHE_L1_ICACHE1_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE1_FAIL_INT_CLR_S  1
/** CACHE_L1_ICACHE2_FAIL_INT_CLR : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FAIL_INT_CLR    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_CLR_M  (CACHE_L1_ICACHE2_FAIL_INT_CLR_V << CACHE_L1_ICACHE2_FAIL_INT_CLR_S)
#define CACHE_L1_ICACHE2_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_CLR_S  2
/** CACHE_L1_ICACHE3_FAIL_INT_CLR : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FAIL_INT_CLR    (BIT(3))
#define CACHE_L1_ICACHE3_FAIL_INT_CLR_M  (CACHE_L1_ICACHE3_FAIL_INT_CLR_V << CACHE_L1_ICACHE3_FAIL_INT_CLR_S)
#define CACHE_L1_ICACHE3_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_ICACHE3_FAIL_INT_CLR_S  3
/** CACHE_L1_CACHE_FAIL_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The bit is used to clear interrupt of access fail that occurs in L1-DCache due to
 *  cpu accesses L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_CLR    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_CLR_M  (CACHE_L1_CACHE_FAIL_INT_CLR_V << CACHE_L1_CACHE_FAIL_INT_CLR_S)
#define CACHE_L1_CACHE_FAIL_INT_CLR_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_CLR_S  4

/** CACHE_L1_CACHE_ACS_FAIL_INT_RAW_REG register
 *  Cache Access Fail Interrupt raw register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_RAW_REG (DR_REG_CACHE_BASE + 0x170)
/** CACHE_L1_ICACHE0_FAIL_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-ICache0.
 */
#define CACHE_L1_ICACHE0_FAIL_INT_RAW    (BIT(0))
#define CACHE_L1_ICACHE0_FAIL_INT_RAW_M  (CACHE_L1_ICACHE0_FAIL_INT_RAW_V << CACHE_L1_ICACHE0_FAIL_INT_RAW_S)
#define CACHE_L1_ICACHE0_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE0_FAIL_INT_RAW_S  0
/** CACHE_L1_ICACHE1_FAIL_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-ICache1.
 */
#define CACHE_L1_ICACHE1_FAIL_INT_RAW    (BIT(1))
#define CACHE_L1_ICACHE1_FAIL_INT_RAW_M  (CACHE_L1_ICACHE1_FAIL_INT_RAW_V << CACHE_L1_ICACHE1_FAIL_INT_RAW_S)
#define CACHE_L1_ICACHE1_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE1_FAIL_INT_RAW_S  1
/** CACHE_L1_ICACHE2_FAIL_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-ICache2.
 */
#define CACHE_L1_ICACHE2_FAIL_INT_RAW    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_RAW_M  (CACHE_L1_ICACHE2_FAIL_INT_RAW_V << CACHE_L1_ICACHE2_FAIL_INT_RAW_S)
#define CACHE_L1_ICACHE2_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_RAW_S  2
/** CACHE_L1_ICACHE3_FAIL_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-ICache3.
 */
#define CACHE_L1_ICACHE3_FAIL_INT_RAW    (BIT(3))
#define CACHE_L1_ICACHE3_FAIL_INT_RAW_M  (CACHE_L1_ICACHE3_FAIL_INT_RAW_V << CACHE_L1_ICACHE3_FAIL_INT_RAW_S)
#define CACHE_L1_ICACHE3_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_ICACHE3_FAIL_INT_RAW_S  3
/** CACHE_L1_CACHE_FAIL_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit of the interrupt of access fail that occurs in L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_RAW    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_RAW_M  (CACHE_L1_CACHE_FAIL_INT_RAW_V << CACHE_L1_CACHE_FAIL_INT_RAW_S)
#define CACHE_L1_CACHE_FAIL_INT_RAW_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_RAW_S  4

/** CACHE_L1_CACHE_ACS_FAIL_INT_ST_REG register
 *  Cache Access Fail Interrupt status register
 */
#define CACHE_L1_CACHE_ACS_FAIL_INT_ST_REG (DR_REG_CACHE_BASE + 0x174)
/** CACHE_L1_ICACHE0_FAIL_INT_ST : HRO; bitpos: [0]; default: 0;
 *  The bit indicates the interrupt status of access fail that occurs in L1-ICache0 due
 *  to cpu accesses L1-ICache.
 */
#define CACHE_L1_ICACHE0_FAIL_INT_ST    (BIT(0))
#define CACHE_L1_ICACHE0_FAIL_INT_ST_M  (CACHE_L1_ICACHE0_FAIL_INT_ST_V << CACHE_L1_ICACHE0_FAIL_INT_ST_S)
#define CACHE_L1_ICACHE0_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE0_FAIL_INT_ST_S  0
/** CACHE_L1_ICACHE1_FAIL_INT_ST : HRO; bitpos: [1]; default: 0;
 *  The bit indicates the interrupt status of access fail that occurs in L1-ICache1 due
 *  to cpu accesses L1-ICache.
 */
#define CACHE_L1_ICACHE1_FAIL_INT_ST    (BIT(1))
#define CACHE_L1_ICACHE1_FAIL_INT_ST_M  (CACHE_L1_ICACHE1_FAIL_INT_ST_V << CACHE_L1_ICACHE1_FAIL_INT_ST_S)
#define CACHE_L1_ICACHE1_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE1_FAIL_INT_ST_S  1
/** CACHE_L1_ICACHE2_FAIL_INT_ST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_FAIL_INT_ST    (BIT(2))
#define CACHE_L1_ICACHE2_FAIL_INT_ST_M  (CACHE_L1_ICACHE2_FAIL_INT_ST_V << CACHE_L1_ICACHE2_FAIL_INT_ST_S)
#define CACHE_L1_ICACHE2_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE2_FAIL_INT_ST_S  2
/** CACHE_L1_ICACHE3_FAIL_INT_ST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_FAIL_INT_ST    (BIT(3))
#define CACHE_L1_ICACHE3_FAIL_INT_ST_M  (CACHE_L1_ICACHE3_FAIL_INT_ST_V << CACHE_L1_ICACHE3_FAIL_INT_ST_S)
#define CACHE_L1_ICACHE3_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE3_FAIL_INT_ST_S  3
/** CACHE_L1_CACHE_FAIL_INT_ST : RO; bitpos: [4]; default: 0;
 *  The bit indicates the interrupt status of access fail that occurs in L1-DCache due
 *  to cpu accesses L1-DCache.
 */
#define CACHE_L1_CACHE_FAIL_INT_ST    (BIT(4))
#define CACHE_L1_CACHE_FAIL_INT_ST_M  (CACHE_L1_CACHE_FAIL_INT_ST_V << CACHE_L1_CACHE_FAIL_INT_ST_S)
#define CACHE_L1_CACHE_FAIL_INT_ST_V  0x00000001U
#define CACHE_L1_CACHE_FAIL_INT_ST_S  4

/** CACHE_L1_CACHE_ACS_CNT_CTRL_REG register
 *  Cache Access Counter enable and clear register
 */
#define CACHE_L1_CACHE_ACS_CNT_CTRL_REG (DR_REG_CACHE_BASE + 0x178)
/** CACHE_L1_IBUS0_CNT_ENA : HRO; bitpos: [0]; default: 0;
 *  The bit is used to enable ibus0 counter in L1-ICache0.
 */
#define CACHE_L1_IBUS0_CNT_ENA    (BIT(0))
#define CACHE_L1_IBUS0_CNT_ENA_M  (CACHE_L1_IBUS0_CNT_ENA_V << CACHE_L1_IBUS0_CNT_ENA_S)
#define CACHE_L1_IBUS0_CNT_ENA_V  0x00000001U
#define CACHE_L1_IBUS0_CNT_ENA_S  0
/** CACHE_L1_IBUS1_CNT_ENA : HRO; bitpos: [1]; default: 0;
 *  The bit is used to enable ibus1 counter in L1-ICache1.
 */
#define CACHE_L1_IBUS1_CNT_ENA    (BIT(1))
#define CACHE_L1_IBUS1_CNT_ENA_M  (CACHE_L1_IBUS1_CNT_ENA_V << CACHE_L1_IBUS1_CNT_ENA_S)
#define CACHE_L1_IBUS1_CNT_ENA_V  0x00000001U
#define CACHE_L1_IBUS1_CNT_ENA_S  1
/** CACHE_L1_IBUS2_CNT_ENA : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_CNT_ENA    (BIT(2))
#define CACHE_L1_IBUS2_CNT_ENA_M  (CACHE_L1_IBUS2_CNT_ENA_V << CACHE_L1_IBUS2_CNT_ENA_S)
#define CACHE_L1_IBUS2_CNT_ENA_V  0x00000001U
#define CACHE_L1_IBUS2_CNT_ENA_S  2
/** CACHE_L1_IBUS3_CNT_ENA : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_CNT_ENA    (BIT(3))
#define CACHE_L1_IBUS3_CNT_ENA_M  (CACHE_L1_IBUS3_CNT_ENA_V << CACHE_L1_IBUS3_CNT_ENA_S)
#define CACHE_L1_IBUS3_CNT_ENA_V  0x00000001U
#define CACHE_L1_IBUS3_CNT_ENA_S  3
/** CACHE_L1_BUS0_CNT_ENA : R/W; bitpos: [4]; default: 0;
 *  The bit is used to enable dbus0 counter in L1-DCache.
 */
#define CACHE_L1_BUS0_CNT_ENA    (BIT(4))
#define CACHE_L1_BUS0_CNT_ENA_M  (CACHE_L1_BUS0_CNT_ENA_V << CACHE_L1_BUS0_CNT_ENA_S)
#define CACHE_L1_BUS0_CNT_ENA_V  0x00000001U
#define CACHE_L1_BUS0_CNT_ENA_S  4
/** CACHE_L1_BUS1_CNT_ENA : R/W; bitpos: [5]; default: 0;
 *  The bit is used to enable dbus1 counter in L1-DCache.
 */
#define CACHE_L1_BUS1_CNT_ENA    (BIT(5))
#define CACHE_L1_BUS1_CNT_ENA_M  (CACHE_L1_BUS1_CNT_ENA_V << CACHE_L1_BUS1_CNT_ENA_S)
#define CACHE_L1_BUS1_CNT_ENA_V  0x00000001U
#define CACHE_L1_BUS1_CNT_ENA_S  5
/** CACHE_L1_DBUS2_CNT_ENA : HRO; bitpos: [6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_CNT_ENA    (BIT(6))
#define CACHE_L1_DBUS2_CNT_ENA_M  (CACHE_L1_DBUS2_CNT_ENA_V << CACHE_L1_DBUS2_CNT_ENA_S)
#define CACHE_L1_DBUS2_CNT_ENA_V  0x00000001U
#define CACHE_L1_DBUS2_CNT_ENA_S  6
/** CACHE_L1_DBUS3_CNT_ENA : HRO; bitpos: [7]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_CNT_ENA    (BIT(7))
#define CACHE_L1_DBUS3_CNT_ENA_M  (CACHE_L1_DBUS3_CNT_ENA_V << CACHE_L1_DBUS3_CNT_ENA_S)
#define CACHE_L1_DBUS3_CNT_ENA_V  0x00000001U
#define CACHE_L1_DBUS3_CNT_ENA_S  7
/** CACHE_L1_IBUS0_CNT_CLR : HRO; bitpos: [16]; default: 0;
 *  The bit is used to clear ibus0 counter in L1-ICache0.
 */
#define CACHE_L1_IBUS0_CNT_CLR    (BIT(16))
#define CACHE_L1_IBUS0_CNT_CLR_M  (CACHE_L1_IBUS0_CNT_CLR_V << CACHE_L1_IBUS0_CNT_CLR_S)
#define CACHE_L1_IBUS0_CNT_CLR_V  0x00000001U
#define CACHE_L1_IBUS0_CNT_CLR_S  16
/** CACHE_L1_IBUS1_CNT_CLR : HRO; bitpos: [17]; default: 0;
 *  The bit is used to clear ibus1 counter in L1-ICache1.
 */
#define CACHE_L1_IBUS1_CNT_CLR    (BIT(17))
#define CACHE_L1_IBUS1_CNT_CLR_M  (CACHE_L1_IBUS1_CNT_CLR_V << CACHE_L1_IBUS1_CNT_CLR_S)
#define CACHE_L1_IBUS1_CNT_CLR_V  0x00000001U
#define CACHE_L1_IBUS1_CNT_CLR_S  17
/** CACHE_L1_IBUS2_CNT_CLR : HRO; bitpos: [18]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS2_CNT_CLR    (BIT(18))
#define CACHE_L1_IBUS2_CNT_CLR_M  (CACHE_L1_IBUS2_CNT_CLR_V << CACHE_L1_IBUS2_CNT_CLR_S)
#define CACHE_L1_IBUS2_CNT_CLR_V  0x00000001U
#define CACHE_L1_IBUS2_CNT_CLR_S  18
/** CACHE_L1_IBUS3_CNT_CLR : HRO; bitpos: [19]; default: 0;
 *  Reserved
 */
#define CACHE_L1_IBUS3_CNT_CLR    (BIT(19))
#define CACHE_L1_IBUS3_CNT_CLR_M  (CACHE_L1_IBUS3_CNT_CLR_V << CACHE_L1_IBUS3_CNT_CLR_S)
#define CACHE_L1_IBUS3_CNT_CLR_V  0x00000001U
#define CACHE_L1_IBUS3_CNT_CLR_S  19
/** CACHE_L1_BUS0_CNT_CLR : WT; bitpos: [20]; default: 0;
 *  The bit is used to clear dbus0 counter in L1-DCache.
 */
#define CACHE_L1_BUS0_CNT_CLR    (BIT(20))
#define CACHE_L1_BUS0_CNT_CLR_M  (CACHE_L1_BUS0_CNT_CLR_V << CACHE_L1_BUS0_CNT_CLR_S)
#define CACHE_L1_BUS0_CNT_CLR_V  0x00000001U
#define CACHE_L1_BUS0_CNT_CLR_S  20
/** CACHE_L1_BUS1_CNT_CLR : WT; bitpos: [21]; default: 0;
 *  The bit is used to clear dbus1 counter in L1-DCache.
 */
#define CACHE_L1_BUS1_CNT_CLR    (BIT(21))
#define CACHE_L1_BUS1_CNT_CLR_M  (CACHE_L1_BUS1_CNT_CLR_V << CACHE_L1_BUS1_CNT_CLR_S)
#define CACHE_L1_BUS1_CNT_CLR_V  0x00000001U
#define CACHE_L1_BUS1_CNT_CLR_S  21
/** CACHE_L1_DBUS2_CNT_CLR : HRO; bitpos: [22]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS2_CNT_CLR    (BIT(22))
#define CACHE_L1_DBUS2_CNT_CLR_M  (CACHE_L1_DBUS2_CNT_CLR_V << CACHE_L1_DBUS2_CNT_CLR_S)
#define CACHE_L1_DBUS2_CNT_CLR_V  0x00000001U
#define CACHE_L1_DBUS2_CNT_CLR_S  22
/** CACHE_L1_DBUS3_CNT_CLR : HRO; bitpos: [23]; default: 0;
 *  Reserved
 */
#define CACHE_L1_DBUS3_CNT_CLR    (BIT(23))
#define CACHE_L1_DBUS3_CNT_CLR_M  (CACHE_L1_DBUS3_CNT_CLR_V << CACHE_L1_DBUS3_CNT_CLR_S)
#define CACHE_L1_DBUS3_CNT_CLR_V  0x00000001U
#define CACHE_L1_DBUS3_CNT_CLR_S  23

/** CACHE_L1_IBUS0_ACS_HIT_CNT_REG register
 *  L1-ICache bus0 Hit-Access Counter register
 */
#define CACHE_L1_IBUS0_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x17c)
/** CACHE_L1_IBUS0_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS0_HIT_CNT_M  (CACHE_L1_IBUS0_HIT_CNT_V << CACHE_L1_IBUS0_HIT_CNT_S)
#define CACHE_L1_IBUS0_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS0_HIT_CNT_S  0

