espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L1_BUS0_ACS_HIT_CNT_REG register
 *  L1-Cache bus0 Hit-Access Counter register
 */
#define CACHE_L1_BUS0_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x1bc)
/** CACHE_L1_BUS0_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus0 accesses L1-Cache.
 */
#define CACHE_L1_BUS0_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS0_HIT_CNT_M  (CACHE_L1_BUS0_HIT_CNT_V << CACHE_L1_BUS0_HIT_CNT_S)
#define CACHE_L1_BUS0_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS0_HIT_CNT_S  0

/** CACHE_L1_BUS0_ACS_MISS_CNT_REG register
 *  L1-Cache bus0 Miss-Access Counter register
 */
#define CACHE_L1_BUS0_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1c0)
/** CACHE_L1_BUS0_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus0 accesses L1-Cache.
 */
#define CACHE_L1_BUS0_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS0_MISS_CNT_M  (CACHE_L1_BUS0_MISS_CNT_V << CACHE_L1_BUS0_MISS_CNT_S)
#define CACHE_L1_BUS0_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS0_MISS_CNT_S  0

/** CACHE_L1_BUS0_ACS_CONFLICT_CNT_REG register
 *  L1-Cache bus0 Conflict-Access Counter register
 */
#define CACHE_L1_BUS0_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x1c4)
/** CACHE_L1_BUS0_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus0 accesses L1-Cache.
 */
#define CACHE_L1_BUS0_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS0_CONFLICT_CNT_M  (CACHE_L1_BUS0_CONFLICT_CNT_V << CACHE_L1_BUS0_CONFLICT_CNT_S)
#define CACHE_L1_BUS0_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS0_CONFLICT_CNT_S  0

/** CACHE_L1_BUS0_ACS_NXTLVL_CNT_REG register
 *  L1-Cache bus0 Next-Level-Access Counter register
 */
#define CACHE_L1_BUS0_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x1c8)
/** CACHE_L1_BUS0_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-Cache accesses L2-Cache due to
 *  bus0 accessing L1-Cache.
 */
#define CACHE_L1_BUS0_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS0_NXTLVL_CNT_M  (CACHE_L1_BUS0_NXTLVL_CNT_V << CACHE_L1_BUS0_NXTLVL_CNT_S)
#define CACHE_L1_BUS0_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS0_NXTLVL_CNT_S  0

/** CACHE_L1_BUS1_ACS_HIT_CNT_REG register
 *  L1-Cache bus1 Hit-Access Counter register
 */
#define CACHE_L1_BUS1_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x1cc)
/** CACHE_L1_BUS1_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus1 accesses L1-Cache.
 */
#define CACHE_L1_BUS1_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS1_HIT_CNT_M  (CACHE_L1_BUS1_HIT_CNT_V << CACHE_L1_BUS1_HIT_CNT_S)
#define CACHE_L1_BUS1_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS1_HIT_CNT_S  0

/** CACHE_L1_BUS1_ACS_MISS_CNT_REG register
 *  L1-Cache bus1 Miss-Access Counter register
 */
#define CACHE_L1_BUS1_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1d0)
/** CACHE_L1_BUS1_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus1 accesses L1-Cache.
 */
#define CACHE_L1_BUS1_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS1_MISS_CNT_M  (CACHE_L1_BUS1_MISS_CNT_V << CACHE_L1_BUS1_MISS_CNT_S)
#define CACHE_L1_BUS1_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS1_MISS_CNT_S  0

/** CACHE_L1_BUS1_ACS_CONFLICT_CNT_REG register
 *  L1-Cache bus1 Conflict-Access Counter register
 */
#define CACHE_L1_BUS1_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x1d4)
/** CACHE_L1_BUS1_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus1 accesses L1-Cache.
 */
#define CACHE_L1_BUS1_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS1_CONFLICT_CNT_M  (CACHE_L1_BUS1_CONFLICT_CNT_V << CACHE_L1_BUS1_CONFLICT_CNT_S)
#define CACHE_L1_BUS1_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS1_CONFLICT_CNT_S  0

/** CACHE_L1_BUS1_ACS_NXTLVL_CNT_REG register
 *  L1-Cache bus1 Next-Level-Access Counter register
 */
#define CACHE_L1_BUS1_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x1d8)
/** CACHE_L1_BUS1_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-Cache accesses L2-Cache due to
 *  bus1 accessing L1-Cache.
 */
#define CACHE_L1_BUS1_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L1_BUS1_NXTLVL_CNT_M  (CACHE_L1_BUS1_NXTLVL_CNT_V << CACHE_L1_BUS1_NXTLVL_CNT_S)
#define CACHE_L1_BUS1_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L1_BUS1_NXTLVL_CNT_S  0

/** CACHE_L1_DBUS2_ACS_HIT_CNT_REG register
 *  L1-DCache bus2 Hit-Access Counter register
 */
#define CACHE_L1_DBUS2_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x1dc)
/** CACHE_L1_DBUS2_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus2 accesses L1-DCache.
 */
#define CACHE_L1_DBUS2_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS2_HIT_CNT_M  (CACHE_L1_DBUS2_HIT_CNT_V << CACHE_L1_DBUS2_HIT_CNT_S)
#define CACHE_L1_DBUS2_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS2_HIT_CNT_S  0

/** CACHE_L1_DBUS2_ACS_MISS_CNT_REG register
 *  L1-DCache bus2 Miss-Access Counter register
 */
#define CACHE_L1_DBUS2_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1e0)
/** CACHE_L1_DBUS2_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus2 accesses L1-DCache.
 */
#define CACHE_L1_DBUS2_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS2_MISS_CNT_M  (CACHE_L1_DBUS2_MISS_CNT_V << CACHE_L1_DBUS2_MISS_CNT_S)
#define CACHE_L1_DBUS2_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS2_MISS_CNT_S  0

/** CACHE_L1_DBUS2_ACS_CONFLICT_CNT_REG register
 *  L1-DCache bus2 Conflict-Access Counter register
 */
#define CACHE_L1_DBUS2_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x1e4)
/** CACHE_L1_DBUS2_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus2 accesses L1-DCache.
 */
#define CACHE_L1_DBUS2_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS2_CONFLICT_CNT_M  (CACHE_L1_DBUS2_CONFLICT_CNT_V << CACHE_L1_DBUS2_CONFLICT_CNT_S)
#define CACHE_L1_DBUS2_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS2_CONFLICT_CNT_S  0

/** CACHE_L1_DBUS2_ACS_NXTLVL_CNT_REG register
 *  L1-DCache bus2 Next-Level-Access Counter register
 */
#define CACHE_L1_DBUS2_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x1e8)
/** CACHE_L1_DBUS2_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-DCache accesses L2-Cache due to
 *  bus2 accessing L1-DCache.
 */
#define CACHE_L1_DBUS2_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS2_NXTLVL_CNT_M  (CACHE_L1_DBUS2_NXTLVL_CNT_V << CACHE_L1_DBUS2_NXTLVL_CNT_S)
#define CACHE_L1_DBUS2_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS2_NXTLVL_CNT_S  0

/** CACHE_L1_DBUS3_ACS_HIT_CNT_REG register
 *  L1-DCache bus3 Hit-Access Counter register
 */
#define CACHE_L1_DBUS3_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x1ec)
/** CACHE_L1_DBUS3_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus3 accesses L1-DCache.
 */
#define CACHE_L1_DBUS3_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS3_HIT_CNT_M  (CACHE_L1_DBUS3_HIT_CNT_V << CACHE_L1_DBUS3_HIT_CNT_S)
#define CACHE_L1_DBUS3_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS3_HIT_CNT_S  0

/** CACHE_L1_DBUS3_ACS_MISS_CNT_REG register
 *  L1-DCache bus3 Miss-Access Counter register
 */
#define CACHE_L1_DBUS3_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1f0)
/** CACHE_L1_DBUS3_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus3 accesses L1-DCache.
 */
#define CACHE_L1_DBUS3_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS3_MISS_CNT_M  (CACHE_L1_DBUS3_MISS_CNT_V << CACHE_L1_DBUS3_MISS_CNT_S)
#define CACHE_L1_DBUS3_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS3_MISS_CNT_S  0

