espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L1_CACHE_SYNC_PRELOAD_INT_ST_REG register
 *  L1-Cache Access Fail Interrupt status register
 */
#define CACHE_L1_CACHE_SYNC_PRELOAD_INT_ST_REG (DR_REG_CACHE_BASE + 0x230)
/** CACHE_L1_ICACHE0_PLD_DONE_INT_ST : HRO; bitpos: [0]; default: 0;
 *  The bit indicates the status of the interrupt that occurs only when L1-ICache0
 *  preload-operation is done.
 */
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ST    (BIT(0))
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ST_M  (CACHE_L1_ICACHE0_PLD_DONE_INT_ST_V << CACHE_L1_ICACHE0_PLD_DONE_INT_ST_S)
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_DONE_INT_ST_S  0
/** CACHE_L1_ICACHE1_PLD_DONE_INT_ST : HRO; bitpos: [1]; default: 0;
 *  The bit indicates the status of the interrupt that occurs only when L1-ICache1
 *  preload-operation is done.
 */
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ST    (BIT(1))
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ST_M  (CACHE_L1_ICACHE1_PLD_DONE_INT_ST_V << CACHE_L1_ICACHE1_PLD_DONE_INT_ST_S)
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_DONE_INT_ST_S  1
/** CACHE_L1_ICACHE2_PLD_DONE_INT_ST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ST    (BIT(2))
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ST_M  (CACHE_L1_ICACHE2_PLD_DONE_INT_ST_V << CACHE_L1_ICACHE2_PLD_DONE_INT_ST_S)
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_DONE_INT_ST_S  2
/** CACHE_L1_ICACHE3_PLD_DONE_INT_ST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ST    (BIT(3))
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ST_M  (CACHE_L1_ICACHE3_PLD_DONE_INT_ST_V << CACHE_L1_ICACHE3_PLD_DONE_INT_ST_S)
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_DONE_INT_ST_S  3
/** CACHE_L1_CACHE_PLD_DONE_INT_ST : RO; bitpos: [4]; default: 0;
 *  The bit indicates the status of the interrupt that occurs only when L1-Cache
 *  preload-operation is done.
 */
#define CACHE_L1_CACHE_PLD_DONE_INT_ST    (BIT(4))
#define CACHE_L1_CACHE_PLD_DONE_INT_ST_M  (CACHE_L1_CACHE_PLD_DONE_INT_ST_V << CACHE_L1_CACHE_PLD_DONE_INT_ST_S)
#define CACHE_L1_CACHE_PLD_DONE_INT_ST_V  0x00000001U
#define CACHE_L1_CACHE_PLD_DONE_INT_ST_S  4
/** CACHE_SYNC_DONE_INT_ST : RO; bitpos: [6]; default: 0;
 *  The bit indicates the status of the interrupt that occurs only when Cache
 *  sync-operation is done.
 */
#define CACHE_SYNC_DONE_INT_ST    (BIT(6))
#define CACHE_SYNC_DONE_INT_ST_M  (CACHE_SYNC_DONE_INT_ST_V << CACHE_SYNC_DONE_INT_ST_S)
#define CACHE_SYNC_DONE_INT_ST_V  0x00000001U
#define CACHE_SYNC_DONE_INT_ST_S  6
/** CACHE_L1_ICACHE0_PLD_ERR_INT_ST : HRO; bitpos: [7]; default: 0;
 *  The bit indicates the status of the interrupt of L1-ICache0 preload-operation error.
 */
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ST    (BIT(7))
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ST_M  (CACHE_L1_ICACHE0_PLD_ERR_INT_ST_V << CACHE_L1_ICACHE0_PLD_ERR_INT_ST_S)
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_ERR_INT_ST_S  7
/** CACHE_L1_ICACHE1_PLD_ERR_INT_ST : HRO; bitpos: [8]; default: 0;
 *  The bit indicates the status of the interrupt of L1-ICache1 preload-operation error.
 */
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ST    (BIT(8))
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ST_M  (CACHE_L1_ICACHE1_PLD_ERR_INT_ST_V << CACHE_L1_ICACHE1_PLD_ERR_INT_ST_S)
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_ERR_INT_ST_S  8
/** CACHE_L1_ICACHE2_PLD_ERR_INT_ST : HRO; bitpos: [9]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ST    (BIT(9))
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ST_M  (CACHE_L1_ICACHE2_PLD_ERR_INT_ST_V << CACHE_L1_ICACHE2_PLD_ERR_INT_ST_S)
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_ERR_INT_ST_S  9
/** CACHE_L1_ICACHE3_PLD_ERR_INT_ST : HRO; bitpos: [10]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ST    (BIT(10))
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ST_M  (CACHE_L1_ICACHE3_PLD_ERR_INT_ST_V << CACHE_L1_ICACHE3_PLD_ERR_INT_ST_S)
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ST_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_ERR_INT_ST_S  10
/** CACHE_L1_CACHE_PLD_ERR_INT_ST : RO; bitpos: [11]; default: 0;
 *  The bit indicates the status of the interrupt of L1-Cache preload-operation error.
 */
#define CACHE_L1_CACHE_PLD_ERR_INT_ST    (BIT(11))
#define CACHE_L1_CACHE_PLD_ERR_INT_ST_M  (CACHE_L1_CACHE_PLD_ERR_INT_ST_V << CACHE_L1_CACHE_PLD_ERR_INT_ST_S)
#define CACHE_L1_CACHE_PLD_ERR_INT_ST_V  0x00000001U
#define CACHE_L1_CACHE_PLD_ERR_INT_ST_S  11
/** CACHE_SYNC_ERR_INT_ST : RO; bitpos: [13]; default: 0;
 *  The bit indicates the status of the interrupt of Cache sync-operation error.
 */
#define CACHE_SYNC_ERR_INT_ST    (BIT(13))
#define CACHE_SYNC_ERR_INT_ST_M  (CACHE_SYNC_ERR_INT_ST_V << CACHE_SYNC_ERR_INT_ST_S)
#define CACHE_SYNC_ERR_INT_ST_V  0x00000001U
#define CACHE_SYNC_ERR_INT_ST_S  13

/** CACHE_L1_CACHE_SYNC_PRELOAD_EXCEPTION_REG register
 *  Cache Sync/Preload Operation exception register
 */
#define CACHE_L1_CACHE_SYNC_PRELOAD_EXCEPTION_REG (DR_REG_CACHE_BASE + 0x234)
/** CACHE_L1_ICACHE0_PLD_ERR_CODE : RO; bitpos: [1:0]; default: 0;
 *  The value 2 is Only available which means preload size is error in L1-ICache0.
 */
#define CACHE_L1_ICACHE0_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE0_PLD_ERR_CODE_M  (CACHE_L1_ICACHE0_PLD_ERR_CODE_V << CACHE_L1_ICACHE0_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE0_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE0_PLD_ERR_CODE_S  0
/** CACHE_L1_ICACHE1_PLD_ERR_CODE : RO; bitpos: [3:2]; default: 0;
 *  The value 2 is Only available which means preload size is error in L1-ICache1.
 */
#define CACHE_L1_ICACHE1_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE1_PLD_ERR_CODE_M  (CACHE_L1_ICACHE1_PLD_ERR_CODE_V << CACHE_L1_ICACHE1_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE1_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE1_PLD_ERR_CODE_S  2
/** CACHE_L1_ICACHE2_PLD_ERR_CODE : RO; bitpos: [5:4]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE2_PLD_ERR_CODE_M  (CACHE_L1_ICACHE2_PLD_ERR_CODE_V << CACHE_L1_ICACHE2_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE2_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE2_PLD_ERR_CODE_S  4
/** CACHE_L1_ICACHE3_PLD_ERR_CODE : RO; bitpos: [7:6]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_ICACHE3_PLD_ERR_CODE_M  (CACHE_L1_ICACHE3_PLD_ERR_CODE_V << CACHE_L1_ICACHE3_PLD_ERR_CODE_S)
#define CACHE_L1_ICACHE3_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_ICACHE3_PLD_ERR_CODE_S  6
/** CACHE_L1_CACHE_PLD_ERR_CODE : RO; bitpos: [9:8]; default: 0;
 *  The value 2 is Only available which means preload size is error in L1-Cache.
 */
#define CACHE_L1_CACHE_PLD_ERR_CODE    0x00000003U
#define CACHE_L1_CACHE_PLD_ERR_CODE_M  (CACHE_L1_CACHE_PLD_ERR_CODE_V << CACHE_L1_CACHE_PLD_ERR_CODE_S)
#define CACHE_L1_CACHE_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L1_CACHE_PLD_ERR_CODE_S  8
/** CACHE_SYNC_ERR_CODE : RO; bitpos: [13:12]; default: 0;
 *  The values 0-2 are available which means sync map, command conflict and size are
 *  error in Cache System.
 */
#define CACHE_SYNC_ERR_CODE    0x00000003U
#define CACHE_SYNC_ERR_CODE_M  (CACHE_SYNC_ERR_CODE_V << CACHE_SYNC_ERR_CODE_S)
#define CACHE_SYNC_ERR_CODE_V  0x00000003U
#define CACHE_SYNC_ERR_CODE_S  12

/** CACHE_L1_CACHE_SYNC_RST_CTRL_REG register
 *  Cache Sync Reset control register
 */
#define CACHE_L1_CACHE_SYNC_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x238)
/** CACHE_L1_ICACHE0_SYNC_RST : HRO; bitpos: [0]; default: 0;
 *  set this bit to reset sync-logic inside L1-ICache0. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L1_ICACHE0_SYNC_RST    (BIT(0))
#define CACHE_L1_ICACHE0_SYNC_RST_M  (CACHE_L1_ICACHE0_SYNC_RST_V << CACHE_L1_ICACHE0_SYNC_RST_S)
#define CACHE_L1_ICACHE0_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE0_SYNC_RST_S  0
/** CACHE_L1_ICACHE1_SYNC_RST : HRO; bitpos: [1]; default: 0;
 *  set this bit to reset sync-logic inside L1-ICache1. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L1_ICACHE1_SYNC_RST    (BIT(1))
#define CACHE_L1_ICACHE1_SYNC_RST_M  (CACHE_L1_ICACHE1_SYNC_RST_V << CACHE_L1_ICACHE1_SYNC_RST_S)
#define CACHE_L1_ICACHE1_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE1_SYNC_RST_S  1
/** CACHE_L1_ICACHE2_SYNC_RST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_SYNC_RST    (BIT(2))
#define CACHE_L1_ICACHE2_SYNC_RST_M  (CACHE_L1_ICACHE2_SYNC_RST_V << CACHE_L1_ICACHE2_SYNC_RST_S)
#define CACHE_L1_ICACHE2_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE2_SYNC_RST_S  2
/** CACHE_L1_ICACHE3_SYNC_RST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_SYNC_RST    (BIT(3))
#define CACHE_L1_ICACHE3_SYNC_RST_M  (CACHE_L1_ICACHE3_SYNC_RST_V << CACHE_L1_ICACHE3_SYNC_RST_S)
#define CACHE_L1_ICACHE3_SYNC_RST_V  0x00000001U
#define CACHE_L1_ICACHE3_SYNC_RST_S  3
/** CACHE_L1_CACHE_SYNC_RST : R/W; bitpos: [4]; default: 0;
 *  set this bit to reset sync-logic inside L1-Cache. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L1_CACHE_SYNC_RST    (BIT(4))
#define CACHE_L1_CACHE_SYNC_RST_M  (CACHE_L1_CACHE_SYNC_RST_V << CACHE_L1_CACHE_SYNC_RST_S)
#define CACHE_L1_CACHE_SYNC_RST_V  0x00000001U
#define CACHE_L1_CACHE_SYNC_RST_S  4

/** CACHE_L1_CACHE_PRELOAD_RST_CTRL_REG register
 *  Cache Preload Reset control register
 */
#define CACHE_L1_CACHE_PRELOAD_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x23c)
/** CACHE_L1_ICACHE0_PLD_RST : HRO; bitpos: [0]; default: 0;
 *  set this bit to reset preload-logic inside L1-ICache0. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L1_ICACHE0_PLD_RST    (BIT(0))
#define CACHE_L1_ICACHE0_PLD_RST_M  (CACHE_L1_ICACHE0_PLD_RST_V << CACHE_L1_ICACHE0_PLD_RST_S)
#define CACHE_L1_ICACHE0_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE0_PLD_RST_S  0
/** CACHE_L1_ICACHE1_PLD_RST : HRO; bitpos: [1]; default: 0;
 *  set this bit to reset preload-logic inside L1-ICache1. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L1_ICACHE1_PLD_RST    (BIT(1))
#define CACHE_L1_ICACHE1_PLD_RST_M  (CACHE_L1_ICACHE1_PLD_RST_V << CACHE_L1_ICACHE1_PLD_RST_S)
#define CACHE_L1_ICACHE1_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE1_PLD_RST_S  1
/** CACHE_L1_ICACHE2_PLD_RST : HRO; bitpos: [2]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE2_PLD_RST    (BIT(2))
#define CACHE_L1_ICACHE2_PLD_RST_M  (CACHE_L1_ICACHE2_PLD_RST_V << CACHE_L1_ICACHE2_PLD_RST_S)
#define CACHE_L1_ICACHE2_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE2_PLD_RST_S  2
/** CACHE_L1_ICACHE3_PLD_RST : HRO; bitpos: [3]; default: 0;
 *  Reserved
 */
#define CACHE_L1_ICACHE3_PLD_RST    (BIT(3))
#define CACHE_L1_ICACHE3_PLD_RST_M  (CACHE_L1_ICACHE3_PLD_RST_V << CACHE_L1_ICACHE3_PLD_RST_S)
#define CACHE_L1_ICACHE3_PLD_RST_V  0x00000001U
#define CACHE_L1_ICACHE3_PLD_RST_S  3
/** CACHE_L1_CACHE_PLD_RST : R/W; bitpos: [4]; default: 0;
 *  set this bit to reset preload-logic inside L1-Cache. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L1_CACHE_PLD_RST    (BIT(4))
#define CACHE_L1_CACHE_PLD_RST_M  (CACHE_L1_CACHE_PLD_RST_V << CACHE_L1_CACHE_PLD_RST_S)
#define CACHE_L1_CACHE_PLD_RST_V  0x00000001U
#define CACHE_L1_CACHE_PLD_RST_S  4

