espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L2_CACHE_TAG_MEM_POWER_CTRL_REG register
 *  Cache tag memory power control register
 */
#define CACHE_L2_CACHE_TAG_MEM_POWER_CTRL_REG (DR_REG_CACHE_BASE + 0x270)
/** CACHE_L2_CACHE_TAG_MEM_FORCE_ON : HRO; bitpos: [20]; default: 0;
 *  The bit is used to close clock gating of  L2-Cache tag memory. 1: close gating, 0:
 *  open clock gating.
 */
#define CACHE_L2_CACHE_TAG_MEM_FORCE_ON    (BIT(20))
#define CACHE_L2_CACHE_TAG_MEM_FORCE_ON_M  (CACHE_L2_CACHE_TAG_MEM_FORCE_ON_V << CACHE_L2_CACHE_TAG_MEM_FORCE_ON_S)
#define CACHE_L2_CACHE_TAG_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L2_CACHE_TAG_MEM_FORCE_ON_S  20
/** CACHE_L2_CACHE_TAG_MEM_FORCE_PD : HRO; bitpos: [21]; default: 0;
 *  The bit is used to power L2-Cache tag memory down. 0: follow rtc_lslp, 1: power down
 */
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PD    (BIT(21))
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PD_M  (CACHE_L2_CACHE_TAG_MEM_FORCE_PD_V << CACHE_L2_CACHE_TAG_MEM_FORCE_PD_S)
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PD_S  21
/** CACHE_L2_CACHE_TAG_MEM_FORCE_PU : HRO; bitpos: [22]; default: 0;
 *  The bit is used to power L2-Cache tag memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PU    (BIT(22))
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PU_M  (CACHE_L2_CACHE_TAG_MEM_FORCE_PU_V << CACHE_L2_CACHE_TAG_MEM_FORCE_PU_S)
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L2_CACHE_TAG_MEM_FORCE_PU_S  22

/** CACHE_L2_CACHE_DATA_MEM_POWER_CTRL_REG register
 *  Cache data memory power control register
 */
#define CACHE_L2_CACHE_DATA_MEM_POWER_CTRL_REG (DR_REG_CACHE_BASE + 0x274)
/** CACHE_L2_CACHE_DATA_MEM_FORCE_ON : HRO; bitpos: [20]; default: 0;
 *  The bit is used to close clock gating of  L2-Cache data memory. 1: close gating, 0:
 *  open clock gating.
 */
#define CACHE_L2_CACHE_DATA_MEM_FORCE_ON    (BIT(20))
#define CACHE_L2_CACHE_DATA_MEM_FORCE_ON_M  (CACHE_L2_CACHE_DATA_MEM_FORCE_ON_V << CACHE_L2_CACHE_DATA_MEM_FORCE_ON_S)
#define CACHE_L2_CACHE_DATA_MEM_FORCE_ON_V  0x00000001U
#define CACHE_L2_CACHE_DATA_MEM_FORCE_ON_S  20
/** CACHE_L2_CACHE_DATA_MEM_FORCE_PD : HRO; bitpos: [21]; default: 0;
 *  The bit is used to power L2-Cache data memory down. 0: follow rtc_lslp, 1: power
 *  down
 */
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PD    (BIT(21))
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PD_M  (CACHE_L2_CACHE_DATA_MEM_FORCE_PD_V << CACHE_L2_CACHE_DATA_MEM_FORCE_PD_S)
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PD_V  0x00000001U
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PD_S  21
/** CACHE_L2_CACHE_DATA_MEM_FORCE_PU : HRO; bitpos: [22]; default: 0;
 *  The bit is used to power L2-Cache data memory up. 0: follow rtc_lslp, 1: power up
 */
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PU    (BIT(22))
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PU_M  (CACHE_L2_CACHE_DATA_MEM_FORCE_PU_V << CACHE_L2_CACHE_DATA_MEM_FORCE_PU_S)
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PU_V  0x00000001U
#define CACHE_L2_CACHE_DATA_MEM_FORCE_PU_S  22

/** CACHE_L2_CACHE_FREEZE_CTRL_REG register
 *  Cache Freeze control register
 */
#define CACHE_L2_CACHE_FREEZE_CTRL_REG (DR_REG_CACHE_BASE + 0x278)
/** CACHE_L2_CACHE_FREEZE_EN : HRO; bitpos: [20]; default: 0;
 *  The bit is used to enable freeze operation on L2-Cache. It can be cleared by
 *  software.
 */
#define CACHE_L2_CACHE_FREEZE_EN    (BIT(20))
#define CACHE_L2_CACHE_FREEZE_EN_M  (CACHE_L2_CACHE_FREEZE_EN_V << CACHE_L2_CACHE_FREEZE_EN_S)
#define CACHE_L2_CACHE_FREEZE_EN_V  0x00000001U
#define CACHE_L2_CACHE_FREEZE_EN_S  20
/** CACHE_L2_CACHE_FREEZE_MODE : HRO; bitpos: [21]; default: 0;
 *  The bit is used to configure mode of freeze operation L2-Cache. 0: a miss-access
 *  will not stuck. 1: a miss-access will stuck.
 */
#define CACHE_L2_CACHE_FREEZE_MODE    (BIT(21))
#define CACHE_L2_CACHE_FREEZE_MODE_M  (CACHE_L2_CACHE_FREEZE_MODE_V << CACHE_L2_CACHE_FREEZE_MODE_S)
#define CACHE_L2_CACHE_FREEZE_MODE_V  0x00000001U
#define CACHE_L2_CACHE_FREEZE_MODE_S  21
/** CACHE_L2_CACHE_FREEZE_DONE : RO; bitpos: [22]; default: 0;
 *  The bit is used to indicate whether freeze operation on L2-Cache is finished or
 *  not. 0: not finished. 1: finished.
 */
#define CACHE_L2_CACHE_FREEZE_DONE    (BIT(22))
#define CACHE_L2_CACHE_FREEZE_DONE_M  (CACHE_L2_CACHE_FREEZE_DONE_V << CACHE_L2_CACHE_FREEZE_DONE_S)
#define CACHE_L2_CACHE_FREEZE_DONE_V  0x00000001U
#define CACHE_L2_CACHE_FREEZE_DONE_S  22

/** CACHE_L2_CACHE_DATA_MEM_ACS_CONF_REG register
 *  Cache data memory access configure register
 */
#define CACHE_L2_CACHE_DATA_MEM_ACS_CONF_REG (DR_REG_CACHE_BASE + 0x27c)
/** CACHE_L2_CACHE_DATA_MEM_RD_EN : HRO; bitpos: [20]; default: 0;
 *  The bit is used to enable config-bus read L2-Cache data memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L2_CACHE_DATA_MEM_RD_EN    (BIT(20))
#define CACHE_L2_CACHE_DATA_MEM_RD_EN_M  (CACHE_L2_CACHE_DATA_MEM_RD_EN_V << CACHE_L2_CACHE_DATA_MEM_RD_EN_S)
#define CACHE_L2_CACHE_DATA_MEM_RD_EN_V  0x00000001U
#define CACHE_L2_CACHE_DATA_MEM_RD_EN_S  20
/** CACHE_L2_CACHE_DATA_MEM_WR_EN : HRO; bitpos: [21]; default: 0;
 *  The bit is used to enable config-bus write L2-Cache data memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L2_CACHE_DATA_MEM_WR_EN    (BIT(21))
#define CACHE_L2_CACHE_DATA_MEM_WR_EN_M  (CACHE_L2_CACHE_DATA_MEM_WR_EN_V << CACHE_L2_CACHE_DATA_MEM_WR_EN_S)
#define CACHE_L2_CACHE_DATA_MEM_WR_EN_V  0x00000001U
#define CACHE_L2_CACHE_DATA_MEM_WR_EN_S  21

/** CACHE_L2_CACHE_TAG_MEM_ACS_CONF_REG register
 *  Cache tag memory access configure register
 */
#define CACHE_L2_CACHE_TAG_MEM_ACS_CONF_REG (DR_REG_CACHE_BASE + 0x280)
/** CACHE_L2_CACHE_TAG_MEM_RD_EN : HRO; bitpos: [20]; default: 0;
 *  The bit is used to enable config-bus read L2-Cache tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L2_CACHE_TAG_MEM_RD_EN    (BIT(20))
#define CACHE_L2_CACHE_TAG_MEM_RD_EN_M  (CACHE_L2_CACHE_TAG_MEM_RD_EN_V << CACHE_L2_CACHE_TAG_MEM_RD_EN_S)
#define CACHE_L2_CACHE_TAG_MEM_RD_EN_V  0x00000001U
#define CACHE_L2_CACHE_TAG_MEM_RD_EN_S  20
/** CACHE_L2_CACHE_TAG_MEM_WR_EN : HRO; bitpos: [21]; default: 0;
 *  The bit is used to enable config-bus write L2-Cache tag memoryory. 0: disable, 1:
 *  enable.
 */
#define CACHE_L2_CACHE_TAG_MEM_WR_EN    (BIT(21))
#define CACHE_L2_CACHE_TAG_MEM_WR_EN_M  (CACHE_L2_CACHE_TAG_MEM_WR_EN_V << CACHE_L2_CACHE_TAG_MEM_WR_EN_S)
#define CACHE_L2_CACHE_TAG_MEM_WR_EN_V  0x00000001U
#define CACHE_L2_CACHE_TAG_MEM_WR_EN_S  21

