espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L2_CACHE_PRELOCK_CONF_REG register
 *  L2 Cache prelock configure register
 */
#define CACHE_L2_CACHE_PRELOCK_CONF_REG (DR_REG_CACHE_BASE + 0x284)
/** CACHE_L2_CACHE_PRELOCK_SCT0_EN : HRO; bitpos: [0]; default: 0;
 *  The bit is used to enable the first section of prelock function on L2-Cache.
 */
#define CACHE_L2_CACHE_PRELOCK_SCT0_EN    (BIT(0))
#define CACHE_L2_CACHE_PRELOCK_SCT0_EN_M  (CACHE_L2_CACHE_PRELOCK_SCT0_EN_V << CACHE_L2_CACHE_PRELOCK_SCT0_EN_S)
#define CACHE_L2_CACHE_PRELOCK_SCT0_EN_V  0x00000001U
#define CACHE_L2_CACHE_PRELOCK_SCT0_EN_S  0
/** CACHE_L2_CACHE_PRELOCK_SCT1_EN : HRO; bitpos: [1]; default: 0;
 *  The bit is used to enable the second section of prelock function on L2-Cache.
 */
#define CACHE_L2_CACHE_PRELOCK_SCT1_EN    (BIT(1))
#define CACHE_L2_CACHE_PRELOCK_SCT1_EN_M  (CACHE_L2_CACHE_PRELOCK_SCT1_EN_V << CACHE_L2_CACHE_PRELOCK_SCT1_EN_S)
#define CACHE_L2_CACHE_PRELOCK_SCT1_EN_V  0x00000001U
#define CACHE_L2_CACHE_PRELOCK_SCT1_EN_S  1
/** CACHE_L2_CACHE_PRELOCK_RGID : HRO; bitpos: [5:2]; default: 0;
 *  The bit is used to set  the gid of l2 cache prelock.
 */
#define CACHE_L2_CACHE_PRELOCK_RGID    0x0000000FU
#define CACHE_L2_CACHE_PRELOCK_RGID_M  (CACHE_L2_CACHE_PRELOCK_RGID_V << CACHE_L2_CACHE_PRELOCK_RGID_S)
#define CACHE_L2_CACHE_PRELOCK_RGID_V  0x0000000FU
#define CACHE_L2_CACHE_PRELOCK_RGID_S  2

/** CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_REG register
 *  L2 Cache prelock section0 address configure register
 */
#define CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_REG (DR_REG_CACHE_BASE + 0x288)
/** CACHE_L2_CACHE_PRELOCK_SCT0_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the first section of
 *  prelock on L2-Cache, which should be used together with
 *  L2_CACHE_PRELOCK_SCT0_SIZE_REG
 */
#define CACHE_L2_CACHE_PRELOCK_SCT0_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_M  (CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_V << CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_S)
#define CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT0_ADDR_S  0

/** CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_REG register
 *  L2 Cache prelock section1 address configure register
 */
#define CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_REG (DR_REG_CACHE_BASE + 0x28c)
/** CACHE_L2_CACHE_PRELOCK_SCT1_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of the second section of
 *  prelock on L2-Cache, which should be used together with
 *  L2_CACHE_PRELOCK_SCT1_SIZE_REG
 */
#define CACHE_L2_CACHE_PRELOCK_SCT1_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_M  (CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_V << CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_S)
#define CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT1_ADDR_S  0

/** CACHE_L2_CACHE_PRELOCK_SCT_SIZE_REG register
 *  L2 Cache prelock section size configure register
 */
#define CACHE_L2_CACHE_PRELOCK_SCT_SIZE_REG (DR_REG_CACHE_BASE + 0x290)
/** CACHE_L2_CACHE_PRELOCK_SCT0_SIZE : HRO; bitpos: [15:0]; default: 65535;
 *  Those bits are used to configure the size of the first section of prelock on
 *  L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT0_ADDR_REG
 */
#define CACHE_L2_CACHE_PRELOCK_SCT0_SIZE    0x0000FFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT0_SIZE_M  (CACHE_L2_CACHE_PRELOCK_SCT0_SIZE_V << CACHE_L2_CACHE_PRELOCK_SCT0_SIZE_S)
#define CACHE_L2_CACHE_PRELOCK_SCT0_SIZE_V  0x0000FFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT0_SIZE_S  0
/** CACHE_L2_CACHE_PRELOCK_SCT1_SIZE : HRO; bitpos: [31:16]; default: 65535;
 *  Those bits are used to configure the size of the second section of prelock on
 *  L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT1_ADDR_REG
 */
#define CACHE_L2_CACHE_PRELOCK_SCT1_SIZE    0x0000FFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT1_SIZE_M  (CACHE_L2_CACHE_PRELOCK_SCT1_SIZE_V << CACHE_L2_CACHE_PRELOCK_SCT1_SIZE_S)
#define CACHE_L2_CACHE_PRELOCK_SCT1_SIZE_V  0x0000FFFFU
#define CACHE_L2_CACHE_PRELOCK_SCT1_SIZE_S  16

/** CACHE_L2_CACHE_PRELOAD_CTRL_REG register
 *  L2 Cache preload-operation control register
 */
#define CACHE_L2_CACHE_PRELOAD_CTRL_REG (DR_REG_CACHE_BASE + 0x294)
/** CACHE_L2_CACHE_PRELOAD_ENA : R/W/SC; bitpos: [0]; default: 0;
 *  The bit is used to enable preload operation on L2-Cache. It will be cleared by
 *  hardware automatically after preload operation is done.
 */
#define CACHE_L2_CACHE_PRELOAD_ENA    (BIT(0))
#define CACHE_L2_CACHE_PRELOAD_ENA_M  (CACHE_L2_CACHE_PRELOAD_ENA_V << CACHE_L2_CACHE_PRELOAD_ENA_S)
#define CACHE_L2_CACHE_PRELOAD_ENA_V  0x00000001U
#define CACHE_L2_CACHE_PRELOAD_ENA_S  0
/** CACHE_L2_CACHE_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 *  The bit is used to indicate whether preload operation is finished or not. 0: not
 *  finished. 1: finished.
 */
#define CACHE_L2_CACHE_PRELOAD_DONE    (BIT(1))
#define CACHE_L2_CACHE_PRELOAD_DONE_M  (CACHE_L2_CACHE_PRELOAD_DONE_V << CACHE_L2_CACHE_PRELOAD_DONE_S)
#define CACHE_L2_CACHE_PRELOAD_DONE_V  0x00000001U
#define CACHE_L2_CACHE_PRELOAD_DONE_S  1
/** CACHE_L2_CACHE_PRELOAD_ORDER : HRO; bitpos: [2]; default: 0;
 *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
 *  descending.
 */
#define CACHE_L2_CACHE_PRELOAD_ORDER    (BIT(2))
#define CACHE_L2_CACHE_PRELOAD_ORDER_M  (CACHE_L2_CACHE_PRELOAD_ORDER_V << CACHE_L2_CACHE_PRELOAD_ORDER_S)
#define CACHE_L2_CACHE_PRELOAD_ORDER_V  0x00000001U
#define CACHE_L2_CACHE_PRELOAD_ORDER_S  2
/** CACHE_L2_CACHE_PRELOAD_RGID : HRO; bitpos: [6:3]; default: 0;
 *  The bit is used to set  the gid of l2 cache preload.
 */
#define CACHE_L2_CACHE_PRELOAD_RGID    0x0000000FU
#define CACHE_L2_CACHE_PRELOAD_RGID_M  (CACHE_L2_CACHE_PRELOAD_RGID_V << CACHE_L2_CACHE_PRELOAD_RGID_S)
#define CACHE_L2_CACHE_PRELOAD_RGID_V  0x0000000FU
#define CACHE_L2_CACHE_PRELOAD_RGID_S  3

/** CACHE_L2_CACHE_PRELOAD_ADDR_REG register
 *  L2 Cache preload address configure register
 */
#define CACHE_L2_CACHE_PRELOAD_ADDR_REG (DR_REG_CACHE_BASE + 0x298)
/** CACHE_L2_CACHE_PRELOAD_ADDR : HRO; bitpos: [31:0]; default: 0;
 *  Those bits are used to configure the start virtual address of preload on L2-Cache,
 *  which should be used together with L2_CACHE_PRELOAD_SIZE_REG
 */
#define CACHE_L2_CACHE_PRELOAD_ADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_PRELOAD_ADDR_M  (CACHE_L2_CACHE_PRELOAD_ADDR_V << CACHE_L2_CACHE_PRELOAD_ADDR_S)
#define CACHE_L2_CACHE_PRELOAD_ADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_PRELOAD_ADDR_S  0

