espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L2_IBUS3_ACS_NXTLVL_CNT_REG register
 *  L2-Cache bus3 Next-Level-Access Counter register
 */
#define CACHE_L2_IBUS3_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x324)
/** CACHE_L2_IBUS3_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-ICache3 accessing L2-Cache due to bus3 accessing L1-ICache3.
 */
#define CACHE_L2_IBUS3_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L2_IBUS3_NXTLVL_CNT_M  (CACHE_L2_IBUS3_NXTLVL_CNT_V << CACHE_L2_IBUS3_NXTLVL_CNT_S)
#define CACHE_L2_IBUS3_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L2_IBUS3_NXTLVL_CNT_S  0

/** CACHE_L2_DBUS0_ACS_HIT_CNT_REG register
 *  L2-Cache bus0 Hit-Access Counter register
 */
#define CACHE_L2_DBUS0_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x328)
/** CACHE_L2_DBUS0_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-DCache accesses L2-Cache due to
 *  bus0 accessing L1-DCache.
 */
#define CACHE_L2_DBUS0_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS0_HIT_CNT_M  (CACHE_L2_DBUS0_HIT_CNT_V << CACHE_L2_DBUS0_HIT_CNT_S)
#define CACHE_L2_DBUS0_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS0_HIT_CNT_S  0

/** CACHE_L2_DBUS0_ACS_MISS_CNT_REG register
 *  L2-Cache bus0 Miss-Access Counter register
 */
#define CACHE_L2_DBUS0_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x32c)
/** CACHE_L2_DBUS0_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-DCache accesses L2-Cache due to
 *  bus0 accessing L1-DCache.
 */
#define CACHE_L2_DBUS0_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS0_MISS_CNT_M  (CACHE_L2_DBUS0_MISS_CNT_V << CACHE_L2_DBUS0_MISS_CNT_S)
#define CACHE_L2_DBUS0_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS0_MISS_CNT_S  0

/** CACHE_L2_DBUS0_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus0 Conflict-Access Counter register
 */
#define CACHE_L2_DBUS0_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x330)
/** CACHE_L2_DBUS0_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-DCache accesses
 *  L2-Cache due to bus0 accessing L1-DCache.
 */
#define CACHE_L2_DBUS0_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS0_CONFLICT_CNT_M  (CACHE_L2_DBUS0_CONFLICT_CNT_V << CACHE_L2_DBUS0_CONFLICT_CNT_S)
#define CACHE_L2_DBUS0_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS0_CONFLICT_CNT_S  0

/** CACHE_L2_DBUS0_ACS_NXTLVL_CNT_REG register
 *  L2-Cache bus0 Next-Level-Access Counter register
 */
#define CACHE_L2_DBUS0_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x334)
/** CACHE_L2_DBUS0_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-DCache accessing L2-Cache due to bus0 accessing L1-DCache.
 */
#define CACHE_L2_DBUS0_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS0_NXTLVL_CNT_M  (CACHE_L2_DBUS0_NXTLVL_CNT_V << CACHE_L2_DBUS0_NXTLVL_CNT_S)
#define CACHE_L2_DBUS0_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS0_NXTLVL_CNT_S  0

/** CACHE_L2_DBUS1_ACS_HIT_CNT_REG register
 *  L2-Cache bus1 Hit-Access Counter register
 */
#define CACHE_L2_DBUS1_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x338)
/** CACHE_L2_DBUS1_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-DCache accesses L2-Cache due to
 *  bus1 accessing L1-DCache.
 */
#define CACHE_L2_DBUS1_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS1_HIT_CNT_M  (CACHE_L2_DBUS1_HIT_CNT_V << CACHE_L2_DBUS1_HIT_CNT_S)
#define CACHE_L2_DBUS1_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS1_HIT_CNT_S  0

/** CACHE_L2_DBUS1_ACS_MISS_CNT_REG register
 *  L2-Cache bus1 Miss-Access Counter register
 */
#define CACHE_L2_DBUS1_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x33c)
/** CACHE_L2_DBUS1_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-DCache accesses L2-Cache due to
 *  bus1 accessing L1-DCache.
 */
#define CACHE_L2_DBUS1_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS1_MISS_CNT_M  (CACHE_L2_DBUS1_MISS_CNT_V << CACHE_L2_DBUS1_MISS_CNT_S)
#define CACHE_L2_DBUS1_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS1_MISS_CNT_S  0

/** CACHE_L2_DBUS1_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus1 Conflict-Access Counter register
 */
#define CACHE_L2_DBUS1_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x340)
/** CACHE_L2_DBUS1_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-DCache accesses
 *  L2-Cache due to bus1 accessing L1-DCache.
 */
#define CACHE_L2_DBUS1_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS1_CONFLICT_CNT_M  (CACHE_L2_DBUS1_CONFLICT_CNT_V << CACHE_L2_DBUS1_CONFLICT_CNT_S)
#define CACHE_L2_DBUS1_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS1_CONFLICT_CNT_S  0

/** CACHE_L2_DBUS1_ACS_NXTLVL_CNT_REG register
 *  L2-Cache bus1 Next-Level-Access Counter register
 */
#define CACHE_L2_DBUS1_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x344)
/** CACHE_L2_DBUS1_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-DCache accessing L2-Cache due to bus1 accessing L1-DCache.
 */
#define CACHE_L2_DBUS1_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS1_NXTLVL_CNT_M  (CACHE_L2_DBUS1_NXTLVL_CNT_V << CACHE_L2_DBUS1_NXTLVL_CNT_S)
#define CACHE_L2_DBUS1_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS1_NXTLVL_CNT_S  0

/** CACHE_L2_DBUS2_ACS_HIT_CNT_REG register
 *  L2-Cache bus2 Hit-Access Counter register
 */
#define CACHE_L2_DBUS2_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x348)
/** CACHE_L2_DBUS2_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when L1-DCache accesses L2-Cache due to
 *  bus2 accessing L1-DCache.
 */
#define CACHE_L2_DBUS2_HIT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS2_HIT_CNT_M  (CACHE_L2_DBUS2_HIT_CNT_V << CACHE_L2_DBUS2_HIT_CNT_S)
#define CACHE_L2_DBUS2_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS2_HIT_CNT_S  0

/** CACHE_L2_DBUS2_ACS_MISS_CNT_REG register
 *  L2-Cache bus2 Miss-Access Counter register
 */
#define CACHE_L2_DBUS2_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x34c)
/** CACHE_L2_DBUS2_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when L1-DCache accesses L2-Cache due to
 *  bus2 accessing L1-DCache.
 */
#define CACHE_L2_DBUS2_MISS_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS2_MISS_CNT_M  (CACHE_L2_DBUS2_MISS_CNT_V << CACHE_L2_DBUS2_MISS_CNT_S)
#define CACHE_L2_DBUS2_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS2_MISS_CNT_S  0

/** CACHE_L2_DBUS2_ACS_CONFLICT_CNT_REG register
 *  L2-Cache bus2 Conflict-Access Counter register
 */
#define CACHE_L2_DBUS2_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x350)
/** CACHE_L2_DBUS2_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when L1-DCache accesses
 *  L2-Cache due to bus2 accessing L1-DCache.
 */
#define CACHE_L2_DBUS2_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS2_CONFLICT_CNT_M  (CACHE_L2_DBUS2_CONFLICT_CNT_V << CACHE_L2_DBUS2_CONFLICT_CNT_S)
#define CACHE_L2_DBUS2_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS2_CONFLICT_CNT_S  0

/** CACHE_L2_DBUS2_ACS_NXTLVL_CNT_REG register
 *  L2-Cache bus2 Next-Level-Access Counter register
 */
#define CACHE_L2_DBUS2_ACS_NXTLVL_CNT_REG (DR_REG_CACHE_BASE + 0x354)
/** CACHE_L2_DBUS2_NXTLVL_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L2-Cache accesses external memory due
 *  to L1-DCache accessing L2-Cache due to bus2 accessing L1-DCache.
 */
#define CACHE_L2_DBUS2_NXTLVL_CNT    0xFFFFFFFFU
#define CACHE_L2_DBUS2_NXTLVL_CNT_M  (CACHE_L2_DBUS2_NXTLVL_CNT_V << CACHE_L2_DBUS2_NXTLVL_CNT_S)
#define CACHE_L2_DBUS2_NXTLVL_CNT_V  0xFFFFFFFFU
#define CACHE_L2_DBUS2_NXTLVL_CNT_S  0

