espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_L2_CACHE_SYNC_PRELOAD_EXCEPTION_REG register
 *  Cache Sync/Preload Operation exception register
 */
#define CACHE_L2_CACHE_SYNC_PRELOAD_EXCEPTION_REG (DR_REG_CACHE_BASE + 0x380)
/** CACHE_L2_CACHE_PLD_ERR_CODE : RO; bitpos: [11:10]; default: 0;
 *  The value 2 is Only available which means preload size is error in L2-Cache.
 */
#define CACHE_L2_CACHE_PLD_ERR_CODE    0x00000003U
#define CACHE_L2_CACHE_PLD_ERR_CODE_M  (CACHE_L2_CACHE_PLD_ERR_CODE_V << CACHE_L2_CACHE_PLD_ERR_CODE_S)
#define CACHE_L2_CACHE_PLD_ERR_CODE_V  0x00000003U
#define CACHE_L2_CACHE_PLD_ERR_CODE_S  10

/** CACHE_L2_CACHE_SYNC_RST_CTRL_REG register
 *  Cache Sync Reset control register
 */
#define CACHE_L2_CACHE_SYNC_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x384)
/** CACHE_L2_CACHE_SYNC_RST : HRO; bitpos: [5]; default: 0;
 *  set this bit to reset sync-logic inside L2-Cache. Recommend that this should only
 *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
 */
#define CACHE_L2_CACHE_SYNC_RST    (BIT(5))
#define CACHE_L2_CACHE_SYNC_RST_M  (CACHE_L2_CACHE_SYNC_RST_V << CACHE_L2_CACHE_SYNC_RST_S)
#define CACHE_L2_CACHE_SYNC_RST_V  0x00000001U
#define CACHE_L2_CACHE_SYNC_RST_S  5

/** CACHE_L2_CACHE_PRELOAD_RST_CTRL_REG register
 *  Cache Preload Reset control register
 */
#define CACHE_L2_CACHE_PRELOAD_RST_CTRL_REG (DR_REG_CACHE_BASE + 0x388)
/** CACHE_L2_CACHE_PLD_RST : HRO; bitpos: [5]; default: 0;
 *  set this bit to reset preload-logic inside L2-Cache. Recommend that this should
 *  only be used to initialize preload-logic when some fatal error of preload-logic
 *  occurs.
 */
#define CACHE_L2_CACHE_PLD_RST    (BIT(5))
#define CACHE_L2_CACHE_PLD_RST_M  (CACHE_L2_CACHE_PLD_RST_V << CACHE_L2_CACHE_PLD_RST_S)
#define CACHE_L2_CACHE_PLD_RST_V  0x00000001U
#define CACHE_L2_CACHE_PLD_RST_S  5

/** CACHE_L2_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG register
 *  Cache Autoload buffer clear control register
 */
#define CACHE_L2_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG (DR_REG_CACHE_BASE + 0x38c)
/** CACHE_L2_CACHE_ALD_BUF_CLR : HRO; bitpos: [5]; default: 0;
 *  set this bit to clear autoload-buffer inside L2-Cache. If this bit is active,
 *  autoload will not work in L2-Cache. This bit should not be active when autoload
 *  works in L2-Cache.
 */
#define CACHE_L2_CACHE_ALD_BUF_CLR    (BIT(5))
#define CACHE_L2_CACHE_ALD_BUF_CLR_M  (CACHE_L2_CACHE_ALD_BUF_CLR_V << CACHE_L2_CACHE_ALD_BUF_CLR_S)
#define CACHE_L2_CACHE_ALD_BUF_CLR_V  0x00000001U
#define CACHE_L2_CACHE_ALD_BUF_CLR_S  5

/** CACHE_L2_UNALLOCATE_BUFFER_CLEAR_REG register
 *  Unallocate request buffer clear registers
 */
#define CACHE_L2_UNALLOCATE_BUFFER_CLEAR_REG (DR_REG_CACHE_BASE + 0x390)
/** CACHE_L2_CACHE_UNALLOC_CLR : HRO; bitpos: [5]; default: 0;
 *  The bit is used to clear the unallocate request buffer of l2 icache where the
 *  unallocate request is responded but not completed.
 */
#define CACHE_L2_CACHE_UNALLOC_CLR    (BIT(5))
#define CACHE_L2_CACHE_UNALLOC_CLR_M  (CACHE_L2_CACHE_UNALLOC_CLR_V << CACHE_L2_CACHE_UNALLOC_CLR_S)
#define CACHE_L2_CACHE_UNALLOC_CLR_V  0x00000001U
#define CACHE_L2_CACHE_UNALLOC_CLR_S  5

/** CACHE_L2_CACHE_ACCESS_ATTR_CTRL_REG register
 *  L1 Cache access Attribute propagation control register
 */
#define CACHE_L2_CACHE_ACCESS_ATTR_CTRL_REG (DR_REG_CACHE_BASE + 0x394)
/** CACHE_L2_CACHE_ACCESS_FORCE_CC : HRO; bitpos: [0]; default: 1;
 *  Set this bit to force the request to l2 cache with cacheable attribute, otherwise,
 *  the attribute is propagated from L1 cache or CPU, it could be one of cacheable and
 *  non-cacheable.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_CC    (BIT(0))
#define CACHE_L2_CACHE_ACCESS_FORCE_CC_M  (CACHE_L2_CACHE_ACCESS_FORCE_CC_V << CACHE_L2_CACHE_ACCESS_FORCE_CC_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_CC_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_CC_S  0
/** CACHE_L2_CACHE_ACCESS_FORCE_WB : HRO; bitpos: [1]; default: 1;
 *  Set this bit to force the request to l2 cache with write-back attribute, otherwise,
 *  the attribute is propagated from L1 cache or CPU, it could be one of write-back and
 *  write-through.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_WB    (BIT(1))
#define CACHE_L2_CACHE_ACCESS_FORCE_WB_M  (CACHE_L2_CACHE_ACCESS_FORCE_WB_V << CACHE_L2_CACHE_ACCESS_FORCE_WB_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_WB_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_WB_S  1
/** CACHE_L2_CACHE_ACCESS_FORCE_WMA : HRO; bitpos: [2]; default: 1;
 *  Set this bit to force the request to l2 cache with write-miss-allocate attribute,
 *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
 *  write-miss-allocate and write-miss-no-allocate.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA    (BIT(2))
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA_M  (CACHE_L2_CACHE_ACCESS_FORCE_WMA_V << CACHE_L2_CACHE_ACCESS_FORCE_WMA_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_WMA_S  2
/** CACHE_L2_CACHE_ACCESS_FORCE_RMA : HRO; bitpos: [3]; default: 1;
 *  Set this bit to force the request to l2 cache with read-miss-allocate attribute,
 *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
 *  read-miss-allocate and read-miss-no-allocate.
 */
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA    (BIT(3))
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA_M  (CACHE_L2_CACHE_ACCESS_FORCE_RMA_V << CACHE_L2_CACHE_ACCESS_FORCE_RMA_S)
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA_V  0x00000001U
#define CACHE_L2_CACHE_ACCESS_FORCE_RMA_S  3

/** CACHE_L2_CACHE_OBJECT_CTRL_REG register
 *  Cache Tag and Data memory Object control register
 */
#define CACHE_L2_CACHE_OBJECT_CTRL_REG (DR_REG_CACHE_BASE + 0x398)
/** CACHE_L2_CACHE_TAG_OBJECT : HRO; bitpos: [5]; default: 0;
 *  Set this bit to set L2-Cache tag memory as object. This bit should be onehot with
 *  the others fields inside this register.
 */
#define CACHE_L2_CACHE_TAG_OBJECT    (BIT(5))
#define CACHE_L2_CACHE_TAG_OBJECT_M  (CACHE_L2_CACHE_TAG_OBJECT_V << CACHE_L2_CACHE_TAG_OBJECT_S)
#define CACHE_L2_CACHE_TAG_OBJECT_V  0x00000001U
#define CACHE_L2_CACHE_TAG_OBJECT_S  5
/** CACHE_L2_CACHE_MEM_OBJECT : HRO; bitpos: [11]; default: 0;
 *  Set this bit to set L2-Cache data memory as object. This bit should be onehot with
 *  the others fields inside this register.
 */
#define CACHE_L2_CACHE_MEM_OBJECT    (BIT(11))
#define CACHE_L2_CACHE_MEM_OBJECT_M  (CACHE_L2_CACHE_MEM_OBJECT_V << CACHE_L2_CACHE_MEM_OBJECT_S)
#define CACHE_L2_CACHE_MEM_OBJECT_V  0x00000001U
#define CACHE_L2_CACHE_MEM_OBJECT_S  11

/** CACHE_L2_CACHE_WAY_OBJECT_REG register
 *  Cache Tag and Data memory way register
 */
#define CACHE_L2_CACHE_WAY_OBJECT_REG (DR_REG_CACHE_BASE + 0x39c)
/** CACHE_L2_CACHE_WAY_OBJECT : HRO; bitpos: [2:0]; default: 0;
 *  Set this bits to select which way of the tag-object will be accessed. 0: way0, 1:
 *  way1, 2: way2, 3: way3, ?, 7: way7.
 */
#define CACHE_L2_CACHE_WAY_OBJECT    0x00000007U
#define CACHE_L2_CACHE_WAY_OBJECT_M  (CACHE_L2_CACHE_WAY_OBJECT_V << CACHE_L2_CACHE_WAY_OBJECT_S)
#define CACHE_L2_CACHE_WAY_OBJECT_V  0x00000007U
#define CACHE_L2_CACHE_WAY_OBJECT_S  0

/** CACHE_L2_CACHE_VADDR_REG register
 *  Cache Vaddr register
 */
#define CACHE_L2_CACHE_VADDR_REG (DR_REG_CACHE_BASE + 0x3a0)
/** CACHE_L2_CACHE_VADDR : HRO; bitpos: [31:0]; default: 1073741824;
 *  Those bits stores the virtual address which will decide where inside the specified
 *  tag memory object will be accessed.
 */
#define CACHE_L2_CACHE_VADDR    0xFFFFFFFFU
#define CACHE_L2_CACHE_VADDR_M  (CACHE_L2_CACHE_VADDR_V << CACHE_L2_CACHE_VADDR_S)
#define CACHE_L2_CACHE_VADDR_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_VADDR_S  0

/** CACHE_L2_CACHE_DEBUG_BUS_REG register
 *  Cache Tag/data memory content register
 */
#define CACHE_L2_CACHE_DEBUG_BUS_REG (DR_REG_CACHE_BASE + 0x3a4)
/** CACHE_L2_CACHE_DEBUG_BUS : HRO; bitpos: [31:0]; default: 932;
 *  This is a constant place where we can write data to or read data from the tag/data
 *  memory on the specified cache.
 */
#define CACHE_L2_CACHE_DEBUG_BUS    0xFFFFFFFFU
#define CACHE_L2_CACHE_DEBUG_BUS_M  (CACHE_L2_CACHE_DEBUG_BUS_V << CACHE_L2_CACHE_DEBUG_BUS_S)
#define CACHE_L2_CACHE_DEBUG_BUS_V  0xFFFFFFFFU
#define CACHE_L2_CACHE_DEBUG_BUS_S  0

