espressif/esp-idf/components/soc/esp32h2/register/soc/cache_reg.h
/** CACHE_LEVEL_SPLIT1_REG register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 */
#define CACHE_LEVEL_SPLIT1_REG (DR_REG_CACHE_BASE + 0x3a8)
/** CACHE_LEVEL_SPLIT1 : HRO; bitpos: [31:0]; default: 936;
 *  Reserved
 */
#define CACHE_LEVEL_SPLIT1    0xFFFFFFFFU
#define CACHE_LEVEL_SPLIT1_M  (CACHE_LEVEL_SPLIT1_V << CACHE_LEVEL_SPLIT1_S)
#define CACHE_LEVEL_SPLIT1_V  0xFFFFFFFFU
#define CACHE_LEVEL_SPLIT1_S  0

/** CACHE_CLOCK_GATE_REG register
 *  Clock gate control register
 */
#define CACHE_CLOCK_GATE_REG (DR_REG_CACHE_BASE + 0x3ac)
/** CACHE_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  The bit is used to enable clock gate when access all registers in this module.
 */
#define CACHE_CLK_EN    (BIT(0))
#define CACHE_CLK_EN_M  (CACHE_CLK_EN_V << CACHE_CLK_EN_S)
#define CACHE_CLK_EN_V  0x00000001U
#define CACHE_CLK_EN_S  0

/** CACHE_REDUNDANCY_SIG0_REG register
 *  Cache redundancy signal 0 register
 */
#define CACHE_REDUNDANCY_SIG0_REG (DR_REG_CACHE_BASE + 0x3b0)
/** CACHE_REDCY_SIG0 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 */
#define CACHE_REDCY_SIG0    0xFFFFFFFFU
#define CACHE_REDCY_SIG0_M  (CACHE_REDCY_SIG0_V << CACHE_REDCY_SIG0_S)
#define CACHE_REDCY_SIG0_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG0_S  0

/** CACHE_REDUNDANCY_SIG1_REG register
 *  Cache redundancy signal 1 register
 */
#define CACHE_REDUNDANCY_SIG1_REG (DR_REG_CACHE_BASE + 0x3b4)
/** CACHE_REDCY_SIG1 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 */
#define CACHE_REDCY_SIG1    0xFFFFFFFFU
#define CACHE_REDCY_SIG1_M  (CACHE_REDCY_SIG1_V << CACHE_REDCY_SIG1_S)
#define CACHE_REDCY_SIG1_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG1_S  0

/** CACHE_REDUNDANCY_SIG2_REG register
 *  Cache redundancy signal 2 register
 */
#define CACHE_REDUNDANCY_SIG2_REG (DR_REG_CACHE_BASE + 0x3b8)
/** CACHE_REDCY_SIG2 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 */
#define CACHE_REDCY_SIG2    0xFFFFFFFFU
#define CACHE_REDCY_SIG2_M  (CACHE_REDCY_SIG2_V << CACHE_REDCY_SIG2_S)
#define CACHE_REDCY_SIG2_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG2_S  0

/** CACHE_REDUNDANCY_SIG3_REG register
 *  Cache redundancy signal 3 register
 */
#define CACHE_REDUNDANCY_SIG3_REG (DR_REG_CACHE_BASE + 0x3bc)
/** CACHE_REDCY_SIG3 : R/W; bitpos: [31:0]; default: 0;
 *  Those bits are prepared for ECO.
 */
#define CACHE_REDCY_SIG3    0xFFFFFFFFU
#define CACHE_REDCY_SIG3_M  (CACHE_REDCY_SIG3_V << CACHE_REDCY_SIG3_S)
#define CACHE_REDCY_SIG3_V  0xFFFFFFFFU
#define CACHE_REDCY_SIG3_S  0

/** CACHE_REDUNDANCY_SIG4_REG register
 *  Cache redundancy signal 0 register
 */
#define CACHE_REDUNDANCY_SIG4_REG (DR_REG_CACHE_BASE + 0x3c0)
/** CACHE_REDCY_SIG4 : RO; bitpos: [3:0]; default: 0;
 *  Those bits are prepared for ECO.
 */
#define CACHE_REDCY_SIG4    0x0000000FU
#define CACHE_REDCY_SIG4_M  (CACHE_REDCY_SIG4_V << CACHE_REDCY_SIG4_S)
#define CACHE_REDCY_SIG4_V  0x0000000FU
#define CACHE_REDCY_SIG4_S  0

/** CACHE_DATE_REG register
 *  Version control register
 */
#define CACHE_DATE_REG (DR_REG_CACHE_BASE + 0x3fc)
/** CACHE_DATE : R/W; bitpos: [27:0]; default: 35680848;
 *  version control register. Note that this default value stored is the latest date
 *  when the hardware logic was updated.
 */
#define CACHE_DATE    0x0FFFFFFFU
#define CACHE_DATE_M  (CACHE_DATE_V << CACHE_DATE_S)
#define CACHE_DATE_V  0x0FFFFFFFU
#define CACHE_DATE_S  0

#ifdef __cplusplus
}
#endif
